[
  {
    "id": "106",
    "name": "Krixi",
    "title": "The Pixie",
    "type": "mage",
    "hint": "Krixi's Mischief has an extremely long range. Use this ability combined with the movement speed bonus from her passive to harass enemies. Nature's Wrath and Moonfall are great for aiding allies in team fights while maintaining a safe distance.",
    "story": "We fairies of the forest are heralds of the Creator. Like other fairies, Krixi could often be found dancing in flowerbeds or playing with the animals. However, whenever danger draws near, Krixi's cruel side would emerge in full force. She would use her sharp fangs and claws to shred any demon who intrudes upon the forest. What really broke Krixi's heart was seeing the humans, whom she once considered her companions, destroying the forest for material wealth. Their armies were highly organized and armed to the teeth, so Krixi gathered the inhabitants of the forest in an effort to fight off the human invaders. The plan worked, and she was able to coerce the humans into signing a peace treaty. The forest quickly returned to its peaceful and serene state, but Krixi knew that the invaders' ambitions weren't much different from that of the demons. She began training wild creatures with human methods and formed her own powerful beast army in hopes to prevent future invasions! War has no other purpose than the destruction of life!",
    "poise": "10%",
    "ad": "50%",
    "ap": "80%",
    "difficulty": "40%",
    "stats": {
      "health": {
        "base": "3088",
        "grow": "202"
      },
      "attack": {
        "base": "153",
        "grow": "7.9"
      },
      "defense": {
        "base": "95",
        "grow": "15.3"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Flutter",
        "description": "When Krixi hits an enemy with an ability, she gains 30% movement speed for 2 seconds.",
        "icon": "10610",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Mischief",
        "description": "Krixi summons a clone to fly about and deal 320 (+0) magic damage to any enemy it touches. Damage decreases by 20% after each hit (down to 40% of original damage).",
        "icon": "10600",
        "cooldown": {
          "base": "75s",
          "grow": "-5s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "10"
        }
      },
      {
        "name": "Nature's Wrath",
        "description": "Krixi summons the power of nature to knock enemies into the air and deal 260 (+0) magic damage.",
        "icon": "10620",
        "cooldown": {
          "base": "130s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      },
      {
        "name": "Moonfall",
        "description": "Krixi summons a meteor shower that pummels nearby enemies, dealing 275 (+0) magic damage with each hit. Each enemy can be hit up to 4 times and the meteor shower lasts for 5 seconds.",
        "icon": "10630",
        "cooldown": {
          "base": "500s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "140",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "49.7%",
      "gameRate": "1.1%",
      "kdaScore": "6.4"
    }
  },
  {
    "id": "107",
    "name": "Zephys",
    "title": "The Doomspear",
    "type": "warrior",
    "hint": "Zephys' passive allows him to keep fighting even with very low HP. Purchase equipment that boosts his survivability. Death's Flurry causes a lot of damage, but make sure to aim it properly to deal as much damage as possible to multiple enemies.",
    "story": "You cannot outrun Death. It cannot be tricked, bargained with, or intimidated. Run, and you'll only die trying. Some cultures told stories of angels or Valkyries that came to lead the dead to the afterlife; however, it was actually Lord Zephys who ferried souls to his domain with a chilling west wind.  Steadfast and meticulous in his duty, Zephys personally harvested the soul of every mortal. In the final terrifying moment of their lives, it was his towering figure that came to rip their spirits from their bodies, so they would face judgment in the underworld. Admired by few and envied by none, Zephys carried the mantle of the harvester with unrivaled dignity, for only he understood the calamity that would ensue should he falter. In times of war, Zephys led his undead army at the front; his ranks ever growing as he reaped.  Run, walk, or crawl, death comes for us all.",
    "poise": "50%",
    "ad": "50%",
    "ap": "60%",
    "difficulty": "50%",
    "stats": {
      "health": {
        "base": "3267",
        "grow": "247.5"
      },
      "attack": {
        "base": "173",
        "grow": "14.8"
      },
      "defense": {
        "base": "84",
        "grow": "22.2"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Unwavering Death",
        "description": "Every 3% of HP lost grants 1% damage reduction.",
        "icon": "10700",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Death Rift",
        "description": "Zephys lunges forward, dealing 190 (+173) physical damage to enemies along the path. His next normal attack deals 85 (+259) physical damage and reduces the enemy's movement speed by 25% for 2 seconds.",
        "icon": "10730",
        "cooldown": {
          "base": "70s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "45",
          "grow": "5"
        }
      },
      {
        "name": "Death's Flurry",
        "description": "Zephys unleashes a series of rapid attacks, dealing 95 (+69) physical damage with each attack to the enemies in front of him. Each hit on an enemy hero restores 35 (+24) HP to Zephys.",
        "icon": "10720",
        "cooldown": {
          "base": "80s",
          "grow": "-8s"
        },
        "energy": {
          "type": "mana",
          "base": "55",
          "grow": "5"
        }
      },
      {
        "name": "Death From Above",
        "description": "Zephys attacks from above, dealing 370 (+242) physical damage to enemies in the target area and knocking them into the air for a brief period. Enemies hit are inflicted with the Thundercrash debuff and take an additional 30 (+22) magic damage when hit by Zephys' normal attacks and abilities.",
        "icon": "10710",
        "cooldown": {
          "base": "180s",
          "grow": "-30s"
        },
        "energy": {
          "type": "mana",
          "base": "135",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "52.4%",
      "gameRate": "1.3%",
      "kdaScore": "7.3"
    }
  },
  {
    "id": "108",
    "name": "Gildur",
    "title": "The Gilded",
    "type": "tank",
    "hint": "Gildur's Indulgence is extremely easy to interrupt. Only use it when you're sure that it will connect. Extravagant can be used from afar, making it great to use as an opener or for ganking.",
    "story": "Gildur once had more money than everyone. With assets all over the continent, his family crest sometimes carried more power than the King's order. His wealth earned him the title of The Gilded. But material wealth made Gildur feel emptier inside than ever. He tried to numb the emptiness with alcohol and the companionship of beautiful women, but that did not help. That was when the Temple of Light, advocating soul-cleansing, caught his attention. The ritualistic religion quickly filled the void inside Gildur, but being the calculative person that he is, Gildur realized that the fervor was not any different from his previous endeavors; he was in no hurry to leave though. After experiencing a religious life, he realized it could be potentially profitable. The hierarchy within the Temple gave him more reasons to seek power. His wealth quickly paved the way for him to rise through the hierarchy and become one of the most powerful men on the continent. My ambition for power is like a beast uncaged. I am not done.",
    "poise": "80%",
    "ad": "30%",
    "ap": "50%",
    "difficulty": "60%",
    "stats": {
      "health": {
        "base": "3378",
        "grow": "352.5"
      },
      "attack": {
        "base": "176",
        "grow": "9.5"
      },
      "defense": {
        "base": "114",
        "grow": "29.5"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Midas Touch",
        "description": "Every 4th normal attack knocks back targets and deals 264 magic damage. Additionally, Gildur gains a shield for a short period of time when he uses any of his abilities.",
        "icon": "10800",
        "cooldown": {
          "base": "8s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Siege",
        "description": "Gildur charges forward, dealing 90 (+79) (+0) physical damage to enemies in his path. His next normal attack becomes Midas Touch.",
        "icon": "10810",
        "cooldown": {
          "base": "100s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Extravagant",
        "description": "Gildur launches molten gold that explodes upon contact with an enemy, stunning and dealing 300 (+0) magic damage to all enemies nearby.",
        "icon": "10820",
        "cooldown": {
          "base": "100s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "10"
        }
      },
      {
        "name": "Indulgence",
        "description": "Gildur summons golden shards that stun and deal 100 (+0) magic damage to every enemy hit. This ability must be channeled and has a maximum duration of 0 seconds. Moving or using another ability after 1 second of channeling will interrupt this ability.",
        "icon": "10830",
        "cooldown": {
          "base": "420s",
          "grow": "-70s"
        },
        "energy": {
          "type": "mana",
          "base": "150",
          "grow": "10"
        }
      }
    ],
    "history": {
      "winRate": "49.7%",
      "gameRate": "1.0%",
      "kdaScore": "6.2"
    }
  },
  {
    "id": "109",
    "name": "Veera",
    "title": "The Soul Harvester",
    "type": "mage",
    "hint": "Veera's Mesmerize has a limited range, so you should be very careful when you use it. It is best to position Veera as far as possible from the enemy when in a team fight.",
    "story": "I'm the Queen of the Night, my name is Veera. The ancient books said that Veera was the most devout and powerful apostle of the Great Ones. Long did she pray and beseech their wisdom, but long have they remained silent.  Eager to prove her mettle, she attempted to take on the Ravagers alone. Surely with their demise by her hand, the Great Ones would reward her with glory. However, it may also be that same hubris that made the Great Ones so disgusted with her. Though she fought bravely and peerlessly, inevitably she was captured. The tortures she suffered need not be mentioned. All that matters was those bright eyes, which once looked up to the heavens for guidance, are now filled with malice and dark fire. Maloch, the leader of the Ravagers, personally performed the tortures, which founded a dark and awful relationship between the two. From then on, she was always by his side, commanding his armies and vanquishing his foes. But she always preferred the silent approach, bringing down the mightiest foes with her wiles and charms. Tome upon tome had been written to warn off men who might ever come across her path to not to listen to the dark shadows whispering promises of greatness; all that lies at the end of that road is doom.  The Queen of Night is patient. She knows ultimately she will always have her way. She will be the last one standing. She still dreams of the day she can bathe in the Great Ones' blood and look them in the eyes, so that they may know her wrath.",
    "poise": "10%",
    "ad": "40%",
    "ap": "90%",
    "difficulty": "30%",
    "stats": {
      "health": {
        "base": "3229",
        "grow": "185.4"
      },
      "attack": {
        "base": "170",
        "grow": "8.8"
      },
      "defense": {
        "base": "86",
        "grow": "17.2"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Sprint",
        "description": "Increases movement speed by 30% for 10 seconds.",
        "icon": "80109",
        "cooldown": "100s"
      }
    ],
    "skills": [
      {
        "name": "Come Hither",
        "description": "Veera applies a Come Hither stack to every enemy hit by her abilities. Each stack reduces an enemy's magic defense by 30-72 (scales with hero level), up to 3 stacks.",
        "icon": "10900",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Hell Bat",
        "description": "Veera summons a Hell Bat that glides forward, dealing 520 (+0) magic damage to enemies hit.",
        "icon": "10910",
        "cooldown": {
          "base": "120s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "5"
        }
      },
      {
        "name": "Mesmerize",
        "description": "Veera blows a kiss at an enemy, dealing 285 (+0) magic damage and stunning the target for 1.5 seconds.",
        "icon": "10920",
        "cooldown": {
          "base": "100s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "90",
          "grow": "0"
        }
      },
      {
        "name": "Inferno Bats",
        "description": "Veera summons up to 5 bats to attack surrounding enemies. Each bat deals 325 (+0) magic damage. If a target has been hit once, all subsequent hits only deal 50% damage.",
        "icon": "10930",
        "cooldown": {
          "base": "180s",
          "grow": "-30s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "49.1%",
      "gameRate": "1.8%",
      "kdaScore": "6.2"
    }
  },
  {
    "id": "105",
    "name": "Toro",
    "title": "The Bull King",
    "type": "tank",
    "hint": "Toro's passive gives him excellent maneuverability. When you think you're about to be immobilized, use an ability to counter those effects. Cooldown speed and HP are incredibly important, so try to purchase items and arcana that boost these attributes.",
    "story": "Wukong, you'll reap what you sow! Toro still held a grudge against Wukong even after all of those years. As the master of Accumlated Thunder Mountain and Emerald Cloud Mountain, Toro was considered one of the great lords of the world. His strength and power were so renowned that he was ranked as the highest of the seven demon kings, even above the great Wukong. Indeed, Toro once shared a good time with Wukong, but everything had turned sour since Wukong's epic journey. Because of Wukong, Toro's concubine was killed and his son taken away by Boddhisattva Guanyin. We're sworn brothers and we said we would be brothers no matter what. Why is he always messing with me? Toro still loses his mind every time he thinks of these tragic events. Toro wanted to confront Wukong to set things straight, but Wukong had become a Buddha upon finishing his journey. Toro felt inferior. After learning that Wukong was heading to Athanor, Toro seized the opportunity and followed Wukong. He won the Afata's trust by revealing his true identity and now looks forward to the decisive battle with his sworn brother. Where is that stupid monkey? I'm gonna teach him a lesson… with my fists.",
    "poise": "110%",
    "ad": "30%",
    "ap": "40%",
    "difficulty": "30%",
    "stats": {
      "health": {
        "base": "3558",
        "grow": "412.2"
      },
      "attack": {
        "base": "163",
        "grow": "8.8"
      },
      "defense": {
        "base": "132",
        "grow": "27.3"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Tough Hide",
        "description": "Will not be affected by control effects when using abilities. Damage taken also reduces by 20%.",
        "icon": "10500",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Bull Rush",
        "description": "Toro lunges towards his enemies, causing 115 (+163) physical damage and knocking them into the air.",
        "icon": "10510",
        "cooldown": {
          "base": "100s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      },
      {
        "name": "Battlecry",
        "description": "Toro bellows with rage and gains a shield that absorbs 250 damage. Also deals 375 (+190) physical damage to enemies within range and slows their movement speed by 35% for 1 second.",
        "icon": "10520",
        "cooldown": {
          "base": "100s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "0"
        }
      },
      {
        "name": "Cracked Earth",
        "description": "Toro leaps to the target area and stomps the ground 3 times. The first 2 stomps deal 150 (+122) physical damage, and the third stomp deals 300 (+244) physical damage. \n\nThe first stomp reduces enemies' movement speed by 30% for 1 second; the second stomp reduces enemies' movement speed by 40% for 1 second; the third stomp knocks enemies into the air.",
        "icon": "10530",
        "cooldown": {
          "base": "400s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "150",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "48.3%",
      "gameRate": "0.4%",
      "kdaScore": "6.1"
    }
  },
  {
    "id": "111",
    "name": "Violet",
    "title": "The Pistol Assassin",
    "type": "marksman",
    "hint": "Violet's passive reduces Tactical Fire's cooldown quickly. Use frequent normal attacks in conjunction with Tactical Fire to harass the enemy. To finish enemies quickly, use Fire in the Hole to slow enemies down, then follow up with Tactical Fire or Concussive Rounds.",
    "story": "My gunshots are the reminders of the vampire menace. During the War of Stakes, Violet rose to fame by headhunting a new breed of vampires called Princes. The abilities of these new vampires were unorthodox yet advanced: their offensive strategies involved the casting of spells to produce fireballs and lightning. Some had the ability of flight as well. The Princes' abilities provided them with great advantages not easily overpowered. Only the likes of Violet, who had undergone extensive training, could rival these unnatural forces and their magic. The more Princes she killed, the more of a threat she became, and the more her name was known throughout the Princes' ranks. Their collectively seething hatred for Violet amplified their desires to destroy her. It motivated them to commit massive amounts of resources and effort to launch long-distance attacks on her army. Her most powerful weapon was her personal firearm, the Rose of Fate, which won countless battles for her. Unfortunately, it was destroyed by a fireball. Violet immediately became weaker and her army began to falter. This enraged her. She vowed to defeat them at all costs, not allowing the loss of her weapon to prevent that from ever happening. If vampires feed on humans, then we shall feed on the vampires!",
    "poise": "20%",
    "ad": "80%",
    "ap": "50%",
    "difficulty": "70%",
    "stats": {
      "health": {
        "base": "3235",
        "grow": "198.5"
      },
      "attack": {
        "base": "172",
        "grow": "17.1"
      },
      "defense": {
        "base": "89",
        "grow": "18.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Reload",
        "description": "Normal attacks reduce Tactical Fire's cooldown by 0.5 seconds.",
        "icon": "11100",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Tactical Fire",
        "description": "Violet rolls forward, enhances her next normal attack and deals 275 (+197) physical damage to enemies on a straight line. The subsequent normal attack within a short period of time retains the range of the enhanced normal attack. Tactical Fire also grants a 50% movement speed bonus that declines over 2 seconds if there are enemy heroes nearby after rolling.",
        "icon": "11110",
        "cooldown": {
          "base": "50s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "5"
        }
      },
      {
        "name": "Fire in the Hole",
        "description": "Violet throws a grenade, dealing 125 (+86) physical damage to enemies within range and slowing their movement speed by 90% for 1 second.",
        "icon": "11120",
        "cooldown": {
          "base": "100s",
          "grow": "-8s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "5"
        }
      },
      {
        "name": "Concussive Rounds",
        "description": "Violet fires Concussive Rounds at nearby enemies, dealing 400 (+258) physical damage.",
        "icon": "11130",
        "cooldown": {
          "base": "300s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "140",
          "grow": "10"
        }
      }
    ],
    "history": {
      "winRate": "50.0%",
      "gameRate": "4.3%",
      "kdaScore": "6.6"
    }
  },
  {
    "id": "112",
    "name": "Yorn",
    "title": "The Hotshot",
    "type": "marksman",
    "hint": "Position Yorn appropriately when he is about to unleash his burst of arrows (his passive). Heavenly Barrage is very useful for team battles and laning, and is best used after each cooldown.",
    "story": "Wherever I go, darkness trembles in terror! The most illustrious warrior of the Temple of Light, the hotshot Yorn was as radiant as his dazzling arrows. Not only was he an accomplished fighter, he was also tall, muscular, and handsome. Adoring female followers had made a laurel wreath and placed it on his silky blond hair, further accentuating his beauty. When he played his harp, the heavenly tune enchanted all who heard. There was not a single trace of darkness in Yorn, for he was the embodiment of light. Whenever the forces of darkness begin to stir, Yorn would mount his steed and lead his army into battle. His divine bow would always be by his side, just as the sun's countless rays of light giving no quarter to darkness. His peerless abilities as an archer meant his arrow never misses its target. During battles, even Maloch himself would be wise to stay out of Yorn's sight to avoid falling victim to the Temple of Light's most powerful weapon. Watch out! I have you in my sight!",
    "poise": "10%",
    "ad": "100%",
    "ap": "30%",
    "difficulty": "70%",
    "stats": {
      "health": {
        "base": "3401",
        "grow": "184.9"
      },
      "attack": {
        "base": "174",
        "grow": "16.2"
      },
      "defense": {
        "base": "88",
        "grow": "16.8"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Roar",
        "description": "Increases attack speed by 60% and attack damage by 10% for 5 seconds.",
        "icon": "80110",
        "cooldown": "60s"
      }
    ],
    "skills": [
      {
        "name": "Fierce Shot",
        "description": "Every 5th consecutive normal attack triggers a burst of arrows, each one dealing 121 physical damage.",
        "icon": "11200",
        "cooldown": {
          "base": "8s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Explosive Arrow",
        "description": "Yorn fires an explosive arrow that deals 120 (+93) physical damage and immobilizes the target for 1 second. His next normal attack becomes a burst shot.",
        "icon": "11210",
        "cooldown": {
          "base": "90s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Heavenly Barrage",
        "description": "Yorn calls down celestial arrows that deal 105 (+73) physical damage to a random enemy in the zone every second. Also, his next normal attack becomes a burst shot.",
        "icon": "11230",
        "cooldown": {
          "base": "200s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Heart Shot",
        "description": "Yorn shoots an arrow that travels extremely far and deals 300 (+214) physical damage, plus magic damage equal to 10% of the target's lost HP. His next normal attack becomes a burst shot.",
        "icon": "11220",
        "cooldown": {
          "base": "180s",
          "grow": "-30s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "10"
        }
      }
    ],
    "history": {
      "winRate": "50.6%",
      "gameRate": "6.0%",
      "kdaScore": "6.5"
    }
  },
  {
    "id": "113",
    "name": "Chaugnar",
    "title": "The Herald of the Void",
    "type": "support",
    "hint": "Chaugnar's Chaos Protection is the most powerful immunity ability in the game. Equip items and arcana that boost his HP and defense to make him even stronger. Chaugnar's abilities also have area effects and short cooldowns, so they can be used frequently when he is close to enemies.",
    "story": "I am chaos incarnate! Chaugnar was an ancient mammoth that was corrupted by the energy of chaos, which transformed him into his current monstrous form. The chaos had not only changed Chaugnar's appearance, but also warped his mind. In his eyes, existence was merely a constant battle between chaos and order. Life, rules, logic, emotions, and faith meant nothing to him. Any unfortunate souls to come before this sinister being would cower when struck with a feeling more terrifying than the mere meaning of the term. If it hadn't been for a gifted human, who lured Chaugnar into a trap and sealed him in the depths of the Black Sea, this world would have been lost long ago. Yet, the power of chaos could never be exterminated completely. All that a human could do is to fight to weaken Chaugnar, mitigating the threat he posed. However, everyone knew that Chaugnar would eventually break out from his shackles, and his fury would rain upon every corner of this world. I will make you watch as this world is devoured by chaos!",
    "poise": "80%",
    "ad": "20%",
    "ap": "60%",
    "difficulty": "40%",
    "stats": {
      "health": {
        "base": "3311",
        "grow": "345.6"
      },
      "attack": {
        "base": "170",
        "grow": "9.1"
      },
      "defense": {
        "base": "150",
        "grow": "24.8"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Void Cleanse",
        "description": "Every time Chaugnar uses Energy Surge, he calls upon chaos energy to remove all control effects, reduce damage taken by 10%, and increase movement speed by 20% for 2 seconds.",
        "icon": "11300",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Energy Surge",
        "description": "Chaugnar unleashes a wave of energy, dealing 375 (+0) magic damage to enemies along the path and slowing their movement speed by 50% for 2 seconds.",
        "icon": "11310",
        "cooldown": {
          "base": "95s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      },
      {
        "name": "Shockwave",
        "description": "Chaugnar trembles and deals 275 (+0) magic damage to all nearby enemies. Damage increases by 30% with each cast and stacks up to 2 times. Also reduces cooldown of Energy Surge by 1 second.",
        "icon": "11320",
        "cooldown": {
          "base": "35s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "45",
          "grow": "0"
        }
      },
      {
        "name": "Chaos Protection",
        "description": "Chaugnar invokes the energies of chaos to remove all control effects from nearby allies, granting them immunity to further control effects, and reducing the damage they take. This buff lasts 0.5 seconds for allies and 3 seconds for himself. This ability also reduces Shockwave's cooldown and removes Shockwave's mana cost for 6 seconds.",
        "icon": "11330",
        "cooldown": {
          "base": "450s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "150",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "51.9%",
      "gameRate": "1.0%",
      "kdaScore": "6.9"
    }
  },
  {
    "id": "114",
    "name": "Omega",
    "title": "The Awoken Mech",
    "type": "tank",
    "hint": "Omega is great at harassing enemies with his maneuverability and control abilities. His abilities also damage structures making him great for pushing.",
    "story": "Peace or war? That is the question. The birth of this weapon was juxtaposed with the capability of destroying all weapons. It was unclear whether or not Omega was created to wage wars or to end them. His existence and the contradictions his abilities possess had captivated and fascinated gods and mortals alike. Omega was one of a kind. It belonged to no specific realm or civilization, yet it possessed intelligence, self-awareness, controlled behavior, and a natural instinct to wage war. Theories suggested that Omega was part of an ancient, powerful, and mysterious civilization that proceeded all civilizations and divine realms of the present. Yet he was the only living proof of it, and was alienated by this world because of it. The intrigue of Omega's origins were not important, for the more pressing issue was its abilities and their contrasting connotations. Omega's compulsion to wage war and his prowess in battles had led suspicions to rise among the gods. They had every reason to doubt by which method Omega was created to end all wars. Violence for violence, war for war!",
    "poise": "90%",
    "ad": "30%",
    "ap": "50%",
    "difficulty": "30%",
    "stats": {
      "health": {
        "base": "3364",
        "grow": "372.7"
      },
      "attack": {
        "base": "178",
        "grow": "8.4"
      },
      "defense": {
        "base": "139",
        "grow": "22.9"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      },
      {
        "name": "Disrupt",
        "description": "Silences a structure for 5 seconds.",
        "icon": "80105",
        "cooldown": "60s"
      }
    ],
    "skills": [
      {
        "name": "Demolition Mode",
        "description": "Omega's abilities deal full damage to structures.",
        "icon": "11400",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Guardian Mode",
        "description": "When activated, Omega gains a damage absorption shield and increases movement speed by 25% for 5 seconds. The next normal attack deals 180 (+178) physical damage, knocking targets into the air briefly.",
        "icon": "11410",
        "cooldown": {
          "base": "120s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Crash Mode",
        "description": "Omega charges forward, dealing 330 (+249) physical damage to enemies and stunning them.",
        "icon": "11420",
        "cooldown": {
          "base": "90s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "65",
          "grow": "5"
        }
      },
      {
        "name": "Exterminate",
        "description": "Omega continuously strikes nearby enemies, dealing 200 (+133) physical damage on each hit.",
        "icon": "11430",
        "cooldown": {
          "base": "300s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "140",
          "grow": "20"
        }
      }
    ],
    "history": {
      "winRate": "49.9%",
      "gameRate": "0.3%",
      "kdaScore": "5.9"
    }
  },
  {
    "id": "110",
    "name": "Kahlii",
    "title": "The Aspect of Vengeance",
    "type": "mage",
    "hint": "Kahlii can move while casting Grievance. This allows her to help teammates retreat easily. Activating her Incorporeal shield before casting Grievance increases her damage output significantly.",
    "story": "I will get you back for what you have done to me, ten-fold! Kahlii roamed the world with vengeance towards the gods. Slowly, her devout believers fell by her knife. She gluttonously devoured their beautiful memories and replaced them with endless fear and horror before their deaths. This was the only thing that could satiate Kahlii's deep hunger for vengeance. The souls of Kahlii's victims were then forced to become her loyal servants. For centuries, sometimes when Kahlii was bored, she would send one of these servants to fetch a living relative or lover, and recruit them into her servitude. Kahlii's preys are not limited to defenseless mortals: angry gods and honorable warriors have also succumbed to her. Embrace the hatred in your heart; it will give you unrivaled power!",
    "poise": "20%",
    "ad": "60%",
    "ap": "80%",
    "difficulty": "70%",
    "stats": {
      "health": {
        "base": "3125",
        "grow": "167.6"
      },
      "attack": {
        "base": "157",
        "grow": "10.9"
      },
      "defense": {
        "base": "91",
        "grow": "14.6"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Damnation",
        "description": "Normal attacks have a pierce effect that deals 157 magic damage.",
        "icon": "11000",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Eternal Blame",
        "description": "Kahlii desecrates the target area, dealing 160 (+0) magic damage every 0.5 seconds to all enemies in the target area and slowing their movement speed by 10% for 2 seconds. The slow effect stacks up to 5 times.",
        "icon": "11010",
        "cooldown": {
          "base": "100s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "10"
        }
      },
      {
        "name": "Incorporeal",
        "description": "Kahlii absorbs the power of the wraith and gains an absorption shield. She also gains 70 ability power and 10% movement speed for 60 seconds.",
        "icon": "11020",
        "cooldown": {
          "base": "120s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "40",
          "grow": "5"
        }
      },
      {
        "name": "Grievance",
        "description": "Kahlii unleashes her frenzied vengeance on enemies. She summons 55 waves of wraiths over 5 seconds that continuously attack enemies in the target direction, each wave dealing 110 (+0) magic damage. Deals 10% more damage to monsters.",
        "icon": "11030",
        "cooldown": {
          "base": "300s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "150",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "50.0%",
      "gameRate": "0.5%",
      "kdaScore": "6.7"
    }
  },
  {
    "id": "116",
    "name": "Butterfly",
    "title": "Death's Whisper",
    "type": "assassin",
    "hint": "Butterfly is a skilled assassin with high burst damage that requires precise timing. Save an ability to secure kills in order to take advantage of her passive ability.",
    "story": "“What should I do after the war is over?” On cold nights, Butterfly's sword emits a crimson light that radiates a sense of warmth. “Survival is never easy for people like me, the people who feed on dirt and blood. I have no time to think about anything else,” her cold voice scoffed from the shadows. Even after several straight days of fighting, Butterfly showed no sign of fatigue. As a well-trained mercenary, she is capable of retaining and recovering her stamina throughout an exhausting war. Butterfly was a code name given by her mercenary order. Unlike ordinary, freelance mercenaries, Butterfly was specially trained by the order. As the order's numbers grew, their requests became more complicated as well. Clients started demanding specific requirements of the mercenaries; they insisted on certain abilities, genders, ages, and even appearances. In response, the order assiduously trained Butterfly to cater to the ever-changing requests. According to her contract, Butterfly, as an orphan, was to be raised by the mercenary order and trained in combat. Growing up, she served as a contractor for the association, requiring her to surrender half of the bounty she earned from every assignment as repayment for the order's investment on her, at least until her debt was cleared. Thanks to her efficiency, competence, and the shortage of other female mercenaries, Butterfly was offered the job of protecting Astrid, the youngest daughter of the Duke of Rose. She had completed numerous similar assignments, most of which required her to accompany noblewomen to different events, offering protection while dressed as a servant. Had it not been such a high-paying assignment, she would have chosen a far more exciting task, like hunting a dragon from the abyss, or eliminating the leader of a group of bandits. Anything else seemed a better alternative to entertaining a bunch of socialites, spending the whole night listening to their trivial gossip. Strangely, the new assignment was not as boring as Butterfly had expected. In retrospect, she was thrilled, if not overwhelmed, by the experience, as she was sent to protect Astrid in a fight against the Lokheim army that had defeated Arduin and the Vedan knights. After the deaths of her father and brother, and the siege of her castle, the young Astrid led the Knights of Rose into battle in the name of the Rose family. Butterfly was hired to protect Astrid, and when the fighting had finally stopped, both were left wounded and scarred from days of battle. In fact, according to the regulations of the mercenary order, Butterfly was entitled to abandon the assignment according to the contract's clause regarding “Colossal Changes in Assignment Complexity.” But she carried on with her duties, protecting Astrid in the absence of the late Duke of Rose, who never thought his daughter would have to go to war. When Astrid raised her father's sword, “Embertrail,” Butterfly’s assignment became almost impossible. But Butterfly did not back down, not only because it was her duty, it was also how she worked. “The word 'flee' is not in my vocabulary.”",
    "poise": "20%",
    "ad": "110%",
    "ap": "40%",
    "difficulty": "60%",
    "stats": {
      "health": {
        "base": "3269",
        "grow": "192.8"
      },
      "attack": {
        "base": "177",
        "grow": "17.9"
      },
      "defense": {
        "base": "89",
        "grow": "17.7"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Assassin",
        "description": "A kill or an assist resets the cooldowns for all of Butterfly's abilities and restores 15% of her lost HP.",
        "icon": "11600",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Whirlwind",
        "description": "Butterfly swings her blade in a full arc at nearby enemies, dealing 200 (+115) physical damage and reducing their movement speed by 50% for 2 seconds.",
        "icon": "11610",
        "cooldown": {
          "base": "60s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Sword Propel",
        "description": "Butterfly throws her sword, dealing 390 (+221) physical damage to enemies in its path. Also increases her attack speed by 50% for 3 seconds.",
        "icon": "11620",
        "cooldown": {
          "base": "80s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Backstab",
        "description": "Butterfly blinks behind the enemy with the lowest HP (prioritizes heroes) and stabs the target, dealing 525 (+238) physical damage, and increasing her damage reduction by 60% and movement speed by 50% for 1 second.",
        "icon": "11630",
        "cooldown": {
          "base": "135s",
          "grow": "-12s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "49.8%",
      "gameRate": "6.4%",
      "kdaScore": "7.1"
    }
  },
  {
    "id": "117",
    "name": "Ormarr",
    "title": "The Frenzy",
    "type": "warrior",
    "hint": "Ormarr's passive triggers randomly, but it is extremely powerful when it triggers. Swagger triggers the same stun effect and damage bonus as Ormarr's passive every 4th time it deals damage, so take advantage when you know these effects will trigger on the next use.",
    "story": "Knock me down and watch me rise again! Born of the Bloody Axe clan, Ormarr had explosive powers and endurance. Ormarr had wielded his massive hammer and sword in countless clan battles, and was always the first to attack and the last to withdraw. His adept fighting abilities and thirst for battle had earned him the nickname The Frenzy, as well as the respect of all of his enemies and his people. It had always been Ormarr's dream to become the leader of his clan, but in his pursuit for power, he made many foolish decisions. He once tried to raid the supplies of an ally, and this lead to his clan being banished to the ice fields of the north. Strangely enough, this did nothing to harm Ormarr's reputation. On the contrary, his people stood firmly behind him as he fought for glory. Ormarr had never disappointed his clan. When the Demon Army engulfed the continent, Ormarr volunteered to lead the campaign to defend his clan's fortress. Outsiders were so impressed by his bravery that they flocked to the fortress, bringing in emergency supplies, reinforcements, and support. From then on, no one dared to describe Ormarr and his clan as barbarians again. The battlefield is the only place for a warrior to die!",
    "poise": "50%",
    "ad": "30%",
    "ap": "70%",
    "difficulty": "50%",
    "stats": {
      "health": {
        "base": "3450",
        "grow": "345"
      },
      "attack": {
        "base": "171",
        "grow": "11.5"
      },
      "defense": {
        "base": "120",
        "grow": "20.2"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Gut Punch",
        "description": "Each time Ormarr deals damage, he has a chance to stun the target and deal physical damage equal to 10-16% (scales with hero level) of the target's current HP. (4 second internal cooldown)",
        "icon": "11700",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Unstoppable",
        "description": "Ormarr dashes forward and enhances his next normal attack to deal 150 (+196) physical damage and knock the target into the air.",
        "icon": "11710",
        "cooldown": {
          "base": "100s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "65",
          "grow": "5"
        }
      },
      {
        "name": "Swagger",
        "description": "Ormarr bashes the ground with his hammer, dealing 215 (+179) physical damage to enemies within range and reducing their movement speed by 50% for 1 second. Each cast that hits 1 or more targets grants Ormarr a stack of Fighting Spirit. After reaching 3 stacks, the next cast will trigger Gut Punch.",
        "icon": "11720",
        "cooldown": {
          "base": "45s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "55",
          "grow": "5"
        }
      },
      {
        "name": "Walking Tall",
        "description": "Ormarr swings his hammer in a circle, dealing 100 (+85) physical damage to enemies within range on each hit.",
        "icon": "11730",
        "cooldown": {
          "base": "280s",
          "grow": "-40s"
        },
        "energy": {
          "type": "mana",
          "base": "140",
          "grow": "20"
        }
      }
    ],
    "history": {
      "winRate": "47.9%",
      "gameRate": "1.0%",
      "kdaScore": "5.9"
    }
  },
  {
    "id": "118",
    "name": "Alice",
    "title": "The Adorable Mystic",
    "type": "support",
    "hint": "Alice's Friendship is a very powerful and unique ability that enables her entire team to go after enemies or retreat quickly. Hissy Fit lowers enemy's magic defense. Pair her with a mage to completely annihilate the enemy.",
    "story": "Alice was the youngest maiden to ever serve in the temple, which was why she was allowed to refuse work and spend her days frolicking with all manner of innocent creatures. The other maidens doted on her, akin to a mother's love for her child. As childlike and innocent as she was, the word fear was not understood by her. Even in the presence of the temple leader, she did not hold back her playfulness. The smile that she shared with everyone from the bottom of her heart never failed to win people over. But it would be foolhardy to underestimate her because of her kind-hearted nature. When the Fallen invaded, Alice left the temple and joined the resistance. Her participation, skill, and magic, greatly bolstered the army's combat strength. With her outstanding contribution, Alice received the title of The Princess. Don't get on the wrong side of this little princess. This warning was always wise to bear in mind. Indeed, all of the enemies that Alice defeated serve to underpin this advice, further proving her prowess. If you were fortunate enough to witness Alice during battle, you would be amazed at how one so small can unleash such a godly force with cataclysmic effects. There is no bravery without fear!",
    "poise": "40%",
    "ad": "40%",
    "ap": "60%",
    "difficulty": "80%",
    "stats": {
      "health": {
        "base": "3208",
        "grow": "257.4"
      },
      "attack": {
        "base": "176",
        "grow": "10.9"
      },
      "defense": {
        "base": "98",
        "grow": "22.5"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Trot",
        "description": "Using abilities increases movement speed by 20% for 1 second.",
        "icon": "11800",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Sunshine",
        "description": "Alice unleashes the power of the sun, dealing 375 (+0) magic damage and stunning enemies.",
        "icon": "11810",
        "cooldown": {
          "base": "100s",
          "grow": "-8s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      },
      {
        "name": "Friendship",
        "description": "Alice creates shields for herself and nearby ally heroes that absorb 125 (+0) damage, and increases their movement speed by 30% for 2 seconds.",
        "icon": "11820",
        "cooldown": {
          "base": "145s",
          "grow": "-12s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "5"
        }
      },
      {
        "name": "Hissy Fit",
        "description": "Alice summons a cursed circle, reducing movement speed of enemies within range by 35% for 2 seconds and decreasing their magic defense by 30%. While active, the circle also deals 75 (+0) magic damage every 0.5 seconds and silences enemies within for 1 second.",
        "icon": "11830",
        "cooldown": {
          "base": "350s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "54.1%",
      "gameRate": "1.1%",
      "kdaScore": "7.2"
    }
  },
  {
    "id": "119",
    "name": "Mganga",
    "title": "The Unspeakable",
    "type": "mage",
    "hint": "Mganga is adept at inflicting continuous magic damage and healing allies. Use his normal attack to mark enemies, then use Detonation to deal a ton of damage.",
    "story": "Power, is the only worthy pursuit. His ruthless nature and thirst for power make Mganga a natural in the world of black magic. In an effort to gain more knowledge, Mganga planned to enslave the strongest of beasts, and trade them with the demons in exchange for powerful black magic. The priests of his tribe caught wind of this wicked plan, and knew they had to intervene. With their powers combined, they finally put a stop to his evil plans. Mganga, always the one to hold a grudge, plotted mercilessly against the priests for their tampering. The priests, seen as the divine light of the tribe, were hung from trees or slaughtered in their own caves… Overnight, the tribe was placed in serious peril. However, it appeared that Mganga's madness had pushed the powers of righteousness too far, and they mounted a counterattack against him. They swarmed him relentlessly, leaving him no choice but to retreat to the deepest parts of Dead Jungle. There, he took refuge amongst the venomous serpents and poisonous marshes. This by no means ended his study of black magic. On the contrary, he used his knowledge to communicate with dark forces, and now his mastery of black magic is greater than ever. The weak cowers before power, whereas the strong dominates it.",
    "poise": "40%",
    "ad": "70%",
    "ap": "30%",
    "difficulty": "40%",
    "stats": {
      "health": {
        "base": "3205",
        "grow": "249.9"
      },
      "attack": {
        "base": "168",
        "grow": "10.1"
      },
      "defense": {
        "base": "87",
        "grow": "20.5"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Voodoo",
        "description": "Normal attacks and abilities inflict a continuous poison effect that deals 25 (+0) magic damage and adds 1 Voodoo Mark (up to 5 marks) to enemy heroes.",
        "icon": "11900",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Toxic",
        "description": "Mganga creates a poisonous cloud at the target area that slowly spreads and deals 40 (+0) magic damage for 4 seconds and slows enemy movement speed by 30% for 2 seconds.",
        "icon": "11910",
        "cooldown": {
          "base": "100s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "55",
          "grow": "5"
        }
      },
      {
        "name": "Fortunate Gift",
        "description": "Mganga hurls magic items in the specified direction to cause 90 (+0) magic damage to any enemy he hits. However, if he hits an ally hero, he will affix a healing mark on them that will recover HP.",
        "icon": "11920",
        "cooldown": {
          "base": "50s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "5"
        }
      },
      {
        "name": "Detonation",
        "description": "Mganga sets off explosions that deal 120 (+0) magic damage to all nearby enemies and heal ally heroes by 120 (+0) HP. Damage dealt is increased by 120(+0) per stack for marked enemies, and HP restored to allies is increased by 50% per stack.",
        "icon": "11930",
        "cooldown": {
          "base": "180s",
          "grow": "-30s"
        },
        "energy": {
          "type": "mana",
          "base": "130",
          "grow": "10"
        }
      }
    ],
    "history": {
      "winRate": "52.7%",
      "gameRate": "2.9%",
      "kdaScore": "7.0"
    }
  },
  {
    "id": "120",
    "name": "Mina",
    "title": "The Reaper Queen",
    "type": "tank",
    "hint": "Out of all the tanks, Mina has the most area of effect abilities. Use them to your advantage in team fights. Death Scythe is very easy to see coming, so try to use it preemptively or as a finisher.",
    "story": "Do you want to live or die? Mina opened her mouth to answer, but couldn't utter a word. The hunger from two days without food and the effects of drugs infused with dark magic were constantly eating away at what was left of her mind. Mganga looked down upon Mina with satisfaction. He could tell that she was nearing the breaking point. The experiment far exceeded his expectations. You must hold on just a little longer, my dear, Mganga said while putting away the equipment, one more day, and you shall be reborn. However, he failed to notice the growing cracks on the straps which had Mina bound. Your turn now. Do you want to live or die? Mganga was caught off guard by the voice behind him. It's not time yet… how did you… Mina's scythe was upon him before he could finish, but Veera, who had been watching in silence, finally made her move as her slender hand effortlessly pushed away the scythe. Mina's savage eyes softened before Veera's charm. Veera was happy with the results, and Mganga got the reward he deserved. As for Mina… her identity and unspeakable secrets were buried together with the remains of the lab, and the Mina that bows before Veera now is the Reaper Queen. Only the living fear death.",
    "poise": "80%",
    "ad": "40%",
    "ap": "40%",
    "difficulty": "30%",
    "stats": {
      "health": {
        "base": "3510",
        "grow": "366.3"
      },
      "attack": {
        "base": "158",
        "grow": "9.3"
      },
      "defense": {
        "base": "120",
        "grow": "22.2"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Daze",
        "description": "Stuns nearby enemies for 0.5 seconds, then reduces their movement speed for 1 second.",
        "icon": "80103",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Sweet Revenge",
        "description": "When taking damage, Mina has a chance to counterattack, dealing 50 (+158)(+70) (2% of own maximum HP) physical damage to nearby enemies.",
        "icon": "12000",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Whirling Scythe",
        "description": "Mina swings her scythe in an arc, dealing 125 (+189)(+70)(2% of own maximum HP) physical damage to all enemies within range.",
        "icon": "12010",
        "cooldown": {
          "base": "80s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "75",
          "grow": "0"
        }
      },
      {
        "name": "Death Scythe",
        "description": "Mina pulls enemies to her with her scythe, dealing 150 (+110) physical damage to affected enemies and slowing their movement speed by 50% for 2 seconds.",
        "icon": "12030",
        "cooldown": {
          "base": "120s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "10"
        }
      },
      {
        "name": "Dark Dominion",
        "description": "Mina taunts nearby enemies, making them attack her for 2 seconds. Damage dealt by taunted enemies is reduced by 50%.",
        "icon": "12020",
        "cooldown": {
          "base": "240s",
          "grow": "-40s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "52.1%",
      "gameRate": "1.1%",
      "kdaScore": "6.1"
    }
  },
  {
    "id": "123",
    "name": "Maloch",
    "title": "The Merciless",
    "type": "warrior",
    "hint": "Use Maloch's Cleave to hit an enemy hero and enchant his weapon. This will make his normal attacks and subsequent Cleave attacks deal true damage and restore a lot of HP.",
    "story": "Torture brings suffering, and suffering brings power. Clawing from the deepest pits of Hell with seething fury and vile intents for torture and suffering, Maloch would become the ruler of the Ravenors.  He knew full well the world's most cruel and sadistic punishments. He enjoyed nothing more than shattering the souls of those unfortunate enough to cross his path. The howls of pain and anguish that emerge from the torture pits within Hell were music to Maloch's ears, and that was where he drew powers from. In this place where light could never touch, the Ravenors were law and they served Maloch.  My underlings hunger for my power, but they shall never have it! Maloch was always proud to demonstrate his cold intellect and vile schemes, and was quick to refute any rumors about his foolhardiness. Maloch's cruelty knew no bounds, and he frequently delighted himself by torturing the Ravenors under his command until their very souls were broken. It helped passing his time, but Maloch gradually grew tired of them as well. Every living soul must lay broken, weeping and pleading for death at my feet! He thought to himself. With this new desire, Maloch left his realm and sought out battles. I will show all that breathe what true suffering really is!",
    "poise": "50%",
    "ad": "80%",
    "ap": "30%",
    "difficulty": "50%",
    "stats": {
      "health": {
        "base": "3564",
        "grow": "270"
      },
      "attack": {
        "base": "170",
        "grow": "12.4"
      },
      "defense": {
        "base": "99",
        "grow": "20.8"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Plunder",
        "description": "Maloch has a longer attack range than other melee units. When his weapon is enchanted, his normal attacks deal 170 true damage instead of physical damage and restore 2% of his lost HP.",
        "icon": "12300",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Cleave",
        "description": "Maloch swings his blade and deals 385 (+244) physical damage. If he hits a hero, his weapon becomes enchanted. When his weapon is enchanted, Cleave will deal true damage and recover 6% (up to 24%) of his own lost HP for every hero it hits.",
        "icon": "12310",
        "cooldown": {
          "base": "50s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Souleater",
        "description": "Maloch snatches the souls of the surrounding enemies, dealing a small amount of physical damage and reducing their movement speed by 30% for 3 seconds. He gains a shield for snatching souls, absorbing up to 800 (+408) damage taken with 4 snatched souls.",
        "icon": "12320",
        "cooldown": {
          "base": "120s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Shock",
        "description": "Maloch unleashes a massacre from above at the specified location. He knocks nearby enemies when he lands and deals 420 (+204) physical damage. Also reduces the movement speed of any enemy that tries to enter or exit the zone.",
        "icon": "12330",
        "cooldown": {
          "base": "600s",
          "grow": "-100s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "50.8%",
      "gameRate": "0.1%",
      "kdaScore": "6.7"
    }
  },
  {
    "id": "115",
    "name": "Jinnar",
    "title": "The Incorruptible",
    "type": "mage",
    "hint": "Jinnar's close range attacks cause a lot of damage, but he is an easy target for opponents. Equip him with defensive items and arcana or he will have to rely on talents to protect himself.",
    "story": "The Spirit Orbs, the fragile and powerful family heirlooms that protected Jinnar's family, also put them in harm's way. Jinnar's ancestors solely relied on the orbs' power to defend themselves and to defeat the demons of Hell.  It was an infinite battle that never ceased. The more the orbs were exposed to dark forces in battle, the more they became tainted with evil. In order to seal the orbs, Jinnar's ancestors sacrificed their souls to protect future generations. The war against the dark forces inevitably continued and the seal loosened throughout the battles, making it vulnerable to be tainted by evil again. Jinnar took it upon himself to travel to the Temple of Light, a sanctuary in which the orbs would be safe. En route to the temple, the traces of evil within the orbs emitted dark energies to Hell, drawing the attention of Maloch the Merciless. Instantaneously, Jinnar was captured by his minions. In that critical moment, outnumbered and badly injured, Jinnar was convinced he was deprived of hope, and that, resistance was futile… until something awakened within the orbs.  The remaining soul energy from his ancestors was awakened, leading Jinnar to victory. Jinnar attained all of his knowledge regarding the orbs shortly thereafter, for he had heard the ancient stories of their capabilities but had never seen them firsthand. The orbs would finally be delivered to the temple. Using his spiritual powers, control, and knowledge over the Spirit Orbs, he gained unanimous approval from the temple to protect them. A newfound desire to grow stronger in order to better protect the orbs and future generations sparked. Lauriel aided him in practicing advanced Zen techniques, which he painfully withstood without uttering a word. Jinnar knew that the purifying power of the light obtained from the advanced Zen techniques could completely cleanse the orbs of their dark energy.",
    "poise": "20%",
    "ad": "40%",
    "ap": "90%",
    "difficulty": "50%",
    "stats": {
      "health": {
        "base": "3122",
        "grow": "217.4"
      },
      "attack": {
        "base": "163",
        "grow": "9.1"
      },
      "defense": {
        "base": "98",
        "grow": "17.5"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Endure",
        "description": "Immobilizes your hero to become invulnerable for 1.5 seconds.",
        "icon": "80112",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Samsara",
        "description": "After Jinnar uses his spirit orbs four times (normal attacks or abilities), the next normal attack will fire a spirit orb with a penetrating effect to deal 300 (+0) magic damage.",
        "icon": "11500",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Battering Beads",
        "description": "Jinnar uses his spirit orbs to attack up to 2 nearby enemies, dealing 300 (+0) magic damage. With each hit, the spirit orb bounces to nearby enemies up to 2 times. If an enemy is already hit once, subsequent hits only deal 30% damage.",
        "icon": "11510",
        "cooldown": {
          "base": "70s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "5"
        }
      },
      {
        "name": "Sutra of Pain",
        "description": "Jinnar creates a spirit orb formation and deals 450 (+0) magic damage to nearby enemies, slowing their movement speed by 35% for 2 seconds.",
        "icon": "11520",
        "cooldown": {
          "base": "120s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Nirvana",
        "description": "Jinnar evokes the power of his spirit orbs to attack nearby enemies 10 times over 5 seconds, dealing 170 (+0) magic damage per hit. When using this ability, Jinnar immediately gains 15% damage reduction plus 5% for each nearby enemy hero for 5 seconds, and 70% movement bonus for 1.5 seconds.",
        "icon": "11530",
        "cooldown": {
          "base": "300s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "140",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "48.4%",
      "gameRate": "0.3%",
      "kdaScore": "6.6"
    }
  },
  {
    "id": "124",
    "name": "Ignis",
    "title": "The Anointed One",
    "type": "mage",
    "hint": "Ignis' passive makes chaining his abilities extremely damaging. Use Fire Crash, followed by Rain of Fire, and finally Holy Embers to take advantage of the escalating additional damage for using his abilities consecutively.",
    "story": "The Holy Flame will lead us to the Kingdom of Truth. The doctrine of the Temple of Light teaches that the Holy Flame is the symbol of light and truth. As guardian of Holy Flame, Ignis has long relied on his abundant knowledge and unshakable faith to lead the faithful along the path of light. It is for this reason that he is widely known as the Guide. However, before attaining this status, Ignis was an ordinary Temple scholar. Obsessed with the pursuit of truth, Ignis spent all his time studying in the Temple's Tower of Contemplation. He read countless ancient texts, among which he discovered Holy Flame manipulation spells that had been long forgotten. Unfortunately the Holy Flame burned out a century ago, making his discovery worthless. Everyone in the Temple lamented this fact. However, Ignis was delighted. His study of the Holy Flame had brought him one step closer to the Kingdom of Truth that he had dreamed of for so long. Although it could not be put into practice, Ignis' discovery sent shockwaves through the forces of darkness that lurked just out of sight. No one could have anticipated that Ignis' next discovery had the potential to break the balance between light and dark. Commanded by the Lord of Darkness, a demon army mounted an attack on the Temple, during which the scorching flames of hell engulfed the entire Tower of Contemplation. The terrified scholars fled, but the resolute Ignis refused to leave. To protect the precious texts, he willingly endured the agonizing burns inflicted by the raging inferno. If this is to be my fate, then bury me in the Kingdom of Truth along with this precious knowledge! This sincere prayer invoked the power of a holy light. Ignis was shocked to see that the red flames of hell had been turned to a holy white by this power. It was the Holy Flame that Ignis had yearned to see for so many years. Although extinguished long ago, it had been reignited within him. Ignis recited a Holy Flame manipulation spell almost instinctively, and the Holy Flame formed a wall of fire, just as he had willed it to. The invaders will be destroyed. The Holy Flame will tear the flesh from their bodies and incinerate their bones! Brought to the brink of defeat, the Temple guard managed to regroup under Ignis' protection and emerged victorious. After the battle, Ignis returned to the Tower of Contemplation and continued his journey along the road to truth. Before truth, the knowledge I possess is but a drop in the ocean.",
    "poise": "20%",
    "ad": "50%",
    "ap": "90%",
    "difficulty": "70%",
    "stats": {
      "health": {
        "base": "3093",
        "grow": "172.9"
      },
      "attack": {
        "base": "160",
        "grow": "9.9"
      },
      "defense": {
        "base": "87",
        "grow": "16.7"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Sprint",
        "description": "Increases movement speed by 30% for 10 seconds.",
        "icon": "80109",
        "cooldown": "100s"
      }
    ],
    "skills": [
      {
        "name": "Sacred Flame",
        "description": "Ignis' abilities place the Mark of the Flame on targets. The mark activates after 1 second and adds an additional effect for his next ability used within 2.5 seconds.",
        "icon": "12400",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Fire Crash",
        "description": "Ignis forms the Sacred Flame into an orb and launches it, dealing 320 (+0) magic damage to the first enemy hit and nearby enemies in a cone behind it. Also increases Ignis' movement speed by 40% for 1 second. If marked targets are hit, then Ignis gains a shield that absorbs 300 (+0) damage for 3 seconds.",
        "icon": "12410",
        "cooldown": {
          "base": "30s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "5"
        }
      },
      {
        "name": "Rain of Fire",
        "description": "Ignis summons a Rain of Fire at the target area for 3 seconds, dealing 135 (+0) magic damage every second to enemies in the area and reducing their movement speed by 30% for 2 seconds. Marked targets are stunned for 1 second.",
        "icon": "12420",
        "cooldown": {
          "base": "120s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "75",
          "grow": "5"
        }
      },
      {
        "name": "Holy Embers",
        "description": "Ignis creates a Sacred Fire formation that deals 700 (+0) magic damage after 1 second to enemy heroes in the target area. Marked targets take 800 (+0) true damage.",
        "icon": "12430",
        "cooldown": {
          "base": "240s",
          "grow": "-40s"
        },
        "energy": {
          "type": "mana",
          "base": "130",
          "grow": "10"
        }
      }
    ],
    "history": {
      "winRate": "51.0%",
      "gameRate": "0.3%",
      "kdaScore": "6.7"
    }
  },
  {
    "id": "127",
    "name": "Azzen'Ka",
    "title": "The Forgotten",
    "type": "mage",
    "hint": "When using Azzen'Ka, pay attention to enemy positioning so you can chain your attacks. Use abilities to trigger his passive and trap enemies, then follow it up with Dust Devil.",
    "story": "I am one with the wind and the sand. A mysterious being, Azzen'Ka wandered the desert and was worshiped as a god by some. Anyone who wished to pass through the desert must make an offering to him or be forever lost. The treacherous terrain had isolated the desert from the rest of the world, and the endless storms have prevented the other gods from entering, leaving Azzen'Ka as the true ruler of the desert. Thane had more than once led his army into the desert in attempts to conquer this sandy realm beyond the control of the gods. However, failure after failure had made it clear that Azzen'Ka had nothing to fear from anyone in his domain. Even the Grim Reaper himself had no choice but to admit that the desert was beyond his control. Although he was confident he could defeat Azzen'Ka, he did not consider himself capable of pacifying the sandstorms. Numerous writings accused Azzen'Ka of being evil, yet travelers reported that Azzen'Ka would guarantee their safety as long as they make an offering to him. This made him more honest and trustworthy than any of the gods in the heavens. It was for this reason that opinions of him were extremely polarized. Some feared and respected him as a god, while others simply loathed him. Azzen'Ka, of course, could not care less. The gods are forbidden from my domain.",
    "poise": "10%",
    "ad": "60%",
    "ap": "70%",
    "difficulty": "50%",
    "stats": {
      "health": {
        "base": "3041",
        "grow": "181.7"
      },
      "attack": {
        "base": "165",
        "grow": "9.4"
      },
      "defense": {
        "base": "87",
        "grow": "17.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Sand Trap",
        "description": "Azzen'Ka's abilities apply a Sand Trap stack on the enemy. After reaching 3 stacks, the enemy will be petrified and suffer 150 (+0) magic damage.",
        "icon": "12700",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Sand Punch",
        "description": "Azzen'Ka summons the shifting sands to attack his enemies, dealing 370 (+0) magic damage and knocking them into the air.",
        "icon": "12710",
        "cooldown": {
          "base": "80s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "65",
          "grow": "5"
        }
      },
      {
        "name": "Dust Devil",
        "description": "Azzen'Ka sends a Dust Devil towards his enemies, bouncing between them and dealing 235 (+0) magic damage. The same target can be hit up to 2 times, only taking 60% damage the 2nd time.",
        "icon": "12720",
        "cooldown": {
          "base": "60s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "10"
        }
      },
      {
        "name": "Sand Wraith",
        "description": "Azzen'Ka calls forth the hand of shifting sands, dealing 200 (+0) magic damage initially. The sand then starts to rage, continuously dealing 140 (+0) magic damage to enemies within the target area and slowing their movement speed by 60%.",
        "icon": "12730",
        "cooldown": {
          "base": "350s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "150",
          "grow": "20"
        }
      }
    ],
    "history": {
      "winRate": "52.6%",
      "gameRate": "1.1%",
      "kdaScore": "6.7"
    }
  },
  {
    "id": "128",
    "name": "Lu Bu",
    "title": "The Great Warlord",
    "type": "warrior",
    "hint": "Try to hit as many enemies as possible with Conqueror to take advantage of Lu Bu's bonus life steal from this ability.",
    "story": "You submit? How dare you submit!  Sitting upon his mighty steed, Red Hare, Lu Bu looked down upon his enemies, prostrate and shaking in horror, and found them inadequate. He could not suppress this anger for much longer. Such victories meant nothing to him. What he desired was a good fight with a real opponent. He loved nothing more than pushing himself when in danger, and that was how he came to be known as the Peerless Warlord.  Lu Bu began to reminisce of his battle against Liu Bei, Guan Yu and Zhang Fei at Hulao Gate. It did indeed seem unfair to fight against the three of them, but Lu Bu was accustomed to these kinds of odds. Truth be told, it was highly unlikely that any other mortal could match him in single combat.  Tell me, am I the strongest warrior in the world?  Lu Bu seldom showed his gentle side as he shone resplendently in his armor. The enchanting Diaochan smiled sweetly at this, and fished out a note from her sleeve.  There may be no one in this world worth fighting with. But, my General, how about the opponents in Heaven? Would you care to battle against them?  In Heaven?! That's it!  Lu Bu could not hide the excitement in his eyes.",
    "poise": "60%",
    "ad": "60%",
    "ap": "50%",
    "difficulty": "60%",
    "stats": {
      "health": {
        "base": "3531",
        "grow": "291.5"
      },
      "attack": {
        "base": "174",
        "grow": "13.4"
      },
      "defense": {
        "base": "104",
        "grow": "19.1"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Martial Master",
        "description": "Impale's cooldown is reduced by 1 second whenever Lu Bu hits a target with an ability or normal attack.",
        "icon": "12800",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Red Stallion",
        "description": "Lu Bu lunges forward, dealing 160 (+146) physical damage to enemies in his path. Lu Bu will stop immediately if he hits an enemy hero. This ability can be used 3 times in a row, with the 3rd cast knocking enemies into the air.",
        "icon": "12810",
        "cooldown": {
          "base": "100s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Impale",
        "description": "Lu Bu launches a mass of dark energy in the specified direction, dealing 240 (+156) physical damage and reducing enemies' movement speed by 50% for 2 seconds.",
        "icon": "12820",
        "cooldown": {
          "base": "120s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Conqueror",
        "description": "Lu Bu powers up, boosting his attack damage by 80, life steal by 120 (+69), and resistance by 20% for 8 seconds.",
        "icon": "12830",
        "cooldown": {
          "base": "300s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "48.8%",
      "gameRate": "1.3%",
      "kdaScore": "6.2"
    }
  },
  {
    "id": "129",
    "name": "Zanis",
    "title": "The Dragoon",
    "type": "warrior",
    "hint": "When in a group battle, cast Zanis' Dragon's Wrath first to control enemies, then use Blood Wyrm to increase his attack speed and finish them off.",
    "story": "Zanis' greatest achievement was undoubtedly his brave endeavor in saving the valuable life of the imperial successor. Since then, the people living on the slopes of Chang-Pan took pride in themselves for being in the birthplace of Zanis, the legendary Dragoon, who was respected by all. Even the undefeated Peerless Warlord, Lu Bu, paid his respects to Zanis. The swing of his spear is like that of a dragon: both furious and graceful. True fear is reflected in the eyes of his enemies when they face his spear in action. His prowess in battles and tactical brilliance could not be denied by any, not even his greatest enemies. I'm not a fighter, Zanis once whispered. Even the wise Zhuge Liang, nicknamed the Crouching Dragon, noticed Zanis was growing weary of the battles. Zhuge Liang could not let Zanis' potential go to waste, so he continued appointing Zanis tasks and missions, leaving him no time to second-guess himself. Regardless of Zanis' feelings towards combat, they never outweighed his loyalty to the emperor or the love for comrades.  I may have grown weary of battle, but I'll always tend to my duties and fight whenever I am needed.",
    "poise": "50%",
    "ad": "80%",
    "ap": "30%",
    "difficulty": "30%",
    "stats": {
      "health": {
        "base": "3434",
        "grow": "291.6"
      },
      "attack": {
        "base": "168",
        "grow": "12.7"
      },
      "defense": {
        "base": "89",
        "grow": "22.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Dragoon",
        "description": "Each kill or assist increases Zanis' attack damage by 12 (stacks up to 20 times) and restores his maximum HP by 5%.",
        "icon": "12900",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Blood Wyrm",
        "description": "Zanis triggers his inner dragon blood to remove all debuffs and increase his movement speed by 80% for 1.5 seconds. He also enhances his next normal attack, which deals an additional 200 physical damage to nearby targets and reduces their movement speed by 50% for 2.5 seconds.",
        "icon": "12910",
        "cooldown": {
          "base": "90s",
          "grow": "-4s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "5"
        }
      },
      {
        "name": "Tail Sweep",
        "description": "NoTrans",
        "icon": "12920",
        "cooldown": {
          "base": "90s",
          "grow": "-4s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Dragon's Wrath",
        "description": "Zanis strikes the target, dealing 300 (+235) true damage and knocking enemies into the air briefly. For the next 5 seconds, he takes 20% less damage and his normal attacks deal an additional 80 (+67) true damage.",
        "icon": "12930",
        "cooldown": {
          "base": "240s",
          "grow": "-40s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "25"
        }
      }
    ],
    "history": {
      "winRate": "50.6%",
      "gameRate": "3.0%",
      "kdaScore": "6.7"
    }
  },
  {
    "id": "130",
    "name": "Airi",
    "title": "The Kunoichi",
    "type": "warrior",
    "hint": "Airi's Spin stuns enemies for a short time, so you can use this ability frequently to contain enemies.\nUse Ryuu when you are around a lot of enemies to gain a more powerful shield.",
    "story": "Dragons dwelled inside the body of their newest descendant, Airi the Kunoichi. Her every breath seemed to exhibit the power of dragons. Many ninja clans had only come into existence recently, but the mysterious Oriental Dragons had been around for generations. This reclusive clan of ninjas loyally protect the peace and tranquility of the realm using the power of the ancient dragons. As the leader of a new generation of ninjas, Airi had not only inherited the title of Kunoichi, her incredible talents had also earned the approval of the Ancient Dragon. She has been bestowed with the almighty Dragon's Mark as well. As night engulfed day, the elite Ninjas led by Airi rushed to save the Temple of Light from the evil forces that surrounded it. Using her shadow clone ability, Airi passed with ease through the savage bombardment of black magic. The iron wall made up of thousands of Fallen crumpled beneath her feet. She transformed herself into a sharp blade and hurled herself straight at Maloch, the commander of the Demon Army, leaving a bloody trail of corpses in her wake. Airi took more and more wounds as she fought her way towards Maloch. By the time she finally reached him, she had defeated nearly all of his demon guards. Airi was punished for her actions with three more mortal wounds. With her strength depleted, Airi realized that she wouldn't stand a chance in a drawn-out battle, so she activated the last bit of power in her Dragon's Mark, raised her blade and sliced at Maloch. In that moment, Maloch was unable to lift his own weapon. He was so overcome by the unleashed dragon spirit that he could only use his demon wings to shield himself from Airi's attacks. The blade rose and fell. Blood hotter than lava gushed out from a wound in Maloch's chest and the impregnable demon wings were tattered. The force from Airi's blade had completely stripped the invincible commander of his combat abilities. Maloch was forced to return to the demon abyss to recover and, in turn, left the demon army their demise. Airi's determination, demonstrated in this battle, immediately earned her the respect of everyone. Even the most despicable of demons could not hide their fear of Airi's blade.",
    "poise": "30%",
    "ad": "100%",
    "ap": "40%",
    "difficulty": "90%",
    "stats": {
      "health": {
        "base": "3243",
        "grow": "211.5"
      },
      "attack": {
        "base": "159",
        "grow": "13.7"
      },
      "defense": {
        "base": "105",
        "grow": "18.5"
      },
      "resistance": {
        "base": "0",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Slash",
        "description": "Each normal attack reduces Spin cooldown by 1 second on hit.",
        "icon": "13000",
        "cooldown": {
          "base": "8s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Spin",
        "description": "Airi slings her shuriken to slice enemies along the path, dealing 180 (+159) physical damage and stunning enemies in her path.",
        "icon": "13010",
        "cooldown": {
          "base": "80s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Shadow",
        "description": "Airi charges in the specified direction and deals 100 (+119) physical damage to enemies in her way. This ability can be cast three times in a row before triggering the cooldown.",
        "icon": "13020",
        "cooldown": {
          "base": "100s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Ryuu",
        "description": "Airi leaps up and summons a spirit that deals 250 (+147) physical damage and reduces enemies' movement speed. Then she strikes the ground, deals the same amount of damage and stuns affected enemies. She also gains a shield that absorbs 250 (+127) damage for every hero hit. Airi is immune to control effects during the ability, gains a 100% movement bonus that decreases over 2.5 seconds and 30% attack speed for 5 seconds.",
        "icon": "13030",
        "cooldown": {
          "base": "400s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "49.0%",
      "gameRate": "1.0%",
      "kdaScore": "6.6"
    }
  },
  {
    "id": "131",
    "name": "Murad",
    "title": "The Wanderer",
    "type": "assassin",
    "hint": "Temporal Turbulence can only be triggered by landing continuous normal attacks, so focus and make sure all those attacks make contact. Triggering Murad's passive gives him a burst in damage output, so make sure he is not under any control effects when it's about to trigger.",
    "story": "Space and time are the fabric in which this world exists. They are also a source of supreme power. However, none of the known systems of magic have spells capable of harnessing the power of space-time. Only an Andura Stone can contain the intangible power of space-time, and allow people to harness it. With the aim of acquiring this power, Murad's ancestors journeyed deep into the desert to look for fragments of Andura. However, Murad's ancestors were able to outsmart Azzen'Ka and acquire the fragments. They used the fragments to forge an extremely powerful weapon that could manipulate space and time, and built a new empire in the desert with its power. When Murad came of age, he inherited the weapon from his father and officially became the heir apparent. He led the imperial army on many expeditions, eliminating dangerous creatures and expanding the empire. This eventually threatened the authority of Azzen'Ka who was furious after discovering the truth behind Murad's weapon. But Murad paid Azzen'Ka no mind. As long as he had the weapon, Azzen'Ka couldn't hurt him. Azzen'Ka was forced to parley with Murad, and capitulate to the demands of the imperial prince. Murad gladly accepted his enemy's willingness to surrender, and missed the golden opportunity to rid the empire of a potential threat once and for all. No power lasts forever, and Azzen'Ka understood this only too well. From the shadows, he manufactured multiple crises that forced Murad to use his weapon to defend the fledgling empire. Overuse of the power accelerated the Andura Stones' decay and, unable to withstand the burden, the weapon developed numerous cracks through which the power of space-time leaked. This efflux greatly weakened Murad's ability to fight, and Azzen'Ka seized the opportunity to conjure a mighty sandstorm that completely engulfed the once prosperous empire. The weapon only had enough power to protect Murad himself, so after a plea by his father, he escaped the catastrophe. But he did not give up. He covered his handsome face and became a solitary desert ranger, seeking a way to repair his weapon while accumulating the strength to confront Azzen'Ka. Murad firmly believes that as long as he has his weapon, he will one day be able to kill Azzen'Ka and restore the honor and glory of his empire.",
    "poise": "30%",
    "ad": "60%",
    "ap": "80%",
    "difficulty": "60%",
    "stats": {
      "health": {
        "base": "2968",
        "grow": "180"
      },
      "attack": {
        "base": "169",
        "grow": "11.5"
      },
      "defense": {
        "base": "98",
        "grow": "18.6"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Rift",
        "description": "On Murad's 4th consecutive normal attack within 3 seconds (ineffective against buildings), he gains 5% attack damage and releases the seal on Temporal Turbulence for 5 seconds.",
        "icon": "13100",
        "cooldown": {
          "base": "8s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Thorn of Time",
        "description": "Murad leaps forward, dealing 120 (+169) physical damage to enemies in his path and stunning them. He can leap again within 5 seconds of the initial cast, and he can return to his starting location if the ability is cast a 3rd time within 5 seconds.",
        "icon": "13110",
        "cooldown": {
          "base": "120s",
          "grow": "-14s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      },
      {
        "name": "Another Dimension",
        "description": "Murad creates a distortion in space and time that deals 110 (+91) physical damage to all enemies in the distortion field. Also deals 180 (+152) physical damage to those entering or leaving the distortion field and reduces their movement speed by 90% for 2 seconds. In addition, he lowers target armor by 100 for 3 seconds. Murad cannot be targeted or attacked while creating the distortion.",
        "icon": "13120",
        "cooldown": {
          "base": "120s",
          "grow": "-4s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "10"
        }
      },
      {
        "name": "Temporal Turbulence",
        "description": "Murad enters a temporal rift, unleashing 5 attacks on enemies in the target area, dealing 150 (+114) physical damage per attack and 50% of life steal effects apply for these attacks. While in the temporal rift, Murad cannot be targeted and attacked. This ability can only be used after Murad's passive opens the seal, which will close again after use.",
        "icon": "13130",
        "cooldown": {
          "base": "120s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "48.9%",
      "gameRate": "1.6%",
      "kdaScore": "6.7"
    }
  },
  {
    "id": "133",
    "name": "Valhein",
    "title": "The Demon Hunter",
    "type": "marksman",
    "hint": "Use Valhein's Bullet Storm at close range to maximize its damage to enemies. After triggering a golden glaive with his passive, quickly follow up with more normal attacks to destroy your stunned opponent.",
    "story": "Mankind's only hope during the century-long vampire war. Valhein was not born a famous vampire hunter. A pious man, he did not believe in superstitions or folklore. This changed while traveling to Romania to claim an inheritance left for him. The journey robbed Valhein of the possibility of a normal life. Helpless and horrified, Valhein could do nothing as Dracula abducted and murdered his wife. His world shattered, Valhein swore vengeance upon the nosferatu and his entire species. I hereby swear in the name of God that I shall defeat all the dark powers lurking within the shadows. I will battle the vampire scourge until my last breath! A man possessed, this solemn vow became his singular driving force.  Valhein sought out vampires wherever they nested, and one by one he slew each and every one of them. When the last had crumbled to dust at his feet, Valhein felt a sudden and certain emptiness. An ethereal voice called out to him You have dared to do what few mortals in history could have done. You have fought back against the creatures of night and triumphed. Yet darkness takes on many forms, vampires were but one of many. As the voice spoke, Valhein felt himself renewed. It continued, Please lend aid, there are other terrors, demons which only you are capable of vanquishing. Valhein steeled himself for his new vigil, as a demon hunter.",
    "poise": "10%",
    "ad": "100%",
    "ap": "30%",
    "difficulty": "30%",
    "stats": {
      "health": {
        "base": "3242",
        "grow": "176.3"
      },
      "attack": {
        "base": "169",
        "grow": "14.8"
      },
      "defense": {
        "base": "95",
        "grow": "17.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Sprint",
        "description": "Increases movement speed by 30% for 10 seconds.",
        "icon": "80109",
        "cooldown": "100s"
      }
    ],
    "skills": [
      {
        "name": "Pocket Glaive",
        "description": "Every 3rd normal attack becomes a glaive with an additional random effect and grants 1 stack of the Hunter buff, which increases 10% movement speed for 2 seconds and stacks up to 5 times.",
        "icon": "13300",
        "cooldown": {
          "base": "8s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Bloody Hunt",
        "description": "Valhein throws a red glaive, dealing 190 (+153) (+0) magic damage to the target and enemies nearby. Grants 1 stack of the Hunter buff.",
        "icon": "13310",
        "cooldown": {
          "base": "100s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "65",
          "grow": "5"
        }
      },
      {
        "name": "Curse of Death",
        "description": "Valhein throws a golden glaive, dealing 150 (+98) (+0) magic damage and stunning the target. Grants 1 stack of the Hunter buff.",
        "icon": "13320",
        "cooldown": {
          "base": "100s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "10"
        }
      },
      {
        "name": "Bullet Storm",
        "description": "NoTrans",
        "icon": "13330",
        "cooldown": {
          "base": "240s",
          "grow": "-40s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "25"
        }
      }
    ],
    "history": {
      "winRate": "49.7%",
      "gameRate": "6.9%",
      "kdaScore": "6.4"
    }
  },
  {
    "id": "134",
    "name": "Skud",
    "title": "The Smasher",
    "type": "warrior",
    "hint": "When you use Skud's Wild Beast Fury to fend off the enemy, be aware of your position as well as the enemy's. This will ensure that the enemy is pushed back to an ideal location where allies can finish them off.",
    "story": "He was a mobile war machine complete with blood running through his veins that was infused with demonic rage. Skud was Mganga's proudest creation. Infused with demonic blood, he possessed an astounding destructive power and a thirst for carnage to match. His powerful fists could shake the courage of anyone who attempted to overthrow the dark rule. During the warring years, Skud was summoned to serve as Preyta's subordinate and lead the Fallen to charge forward. The battle for the Castle of Alchemy proved to be the pinnacle of Skud's achievements. Even though he had fewer than one hundred men, he successfully led them to break through the mechanical defenses that were laid by Moen, the arms specialist. Then he single-handedly destroyed ten alchemy puppets and fought his way into the castle interior. At that moment, Omega, who had been undercover for some time, issued an order to attack. Soon Skud and his men were flooded by a sea of steel. As he watched the Castle of Alchemy's defenses rose again and found himself surrounded by enemies, Skud became infuriated beyond reproach. The demonic blood in his body started boiling and his willpower was ignited. The iron blitz could not stall his progress. The strongest of armor crumpled like paper under his fists. The enraged Skud managed to single-handedly squash the enemy counterattack. Omega grabbed Moen and fled in panic, leaving Skud and his Fallen followers to enjoy the bounty of treasures and resources left by the army. When the battle finally ended, Skud got the reward he deserved: a set of alchemy gloves forged by Moen himself. Mganga made some adjustments that allowed the alchemy gloves to bond with Skud's demonic blood, giving him even more violent destructive powers. My blood boils in anticipation! ",
    "poise": "90%",
    "ad": "60%",
    "ap": "20%",
    "difficulty": "50%",
    "stats": {
      "health": {
        "base": "3213",
        "grow": "280.5"
      },
      "attack": {
        "base": "171",
        "grow": "13.2"
      },
      "defense": {
        "base": "95",
        "grow": "22.9"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Anabolic Rage",
        "description": "Every 10 seconds, Skud's next normal attack deals an additional 20% damage, restores 80 (+128) (+4%  of his maximum HP) HP and 30 (+3%  of  his lost mana) mana. Each normal attack also reduces the cooldown of this ability by 1 second.",
        "icon": "13400",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Furious Charge",
        "description": "NoTrans",
        "icon": "13410",
        "cooldown": {
          "base": "60s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "45",
          "grow": "5"
        }
      },
      {
        "name": "Power Glove",
        "description": "Skud increases his attack speed by 20% and movement speed by 10% for 5 seconds. The next normal attack deals an additional 120 (+85) physical damage to enemies and reduces their movement speed.",
        "icon": "13420",
        "cooldown": {
          "base": "110s",
          "grow": "-4s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Wild Beast Fury",
        "description": "Skud charges for a brief period, then spins and hits all nearby enemies with his fist, dealing 370 (+239) physical damage, knocking them back and stunning them for 1 second. Also deals additional physical damage equal to 15% of the enemy's current HP and resets the cooldown on Furious Charge.",
        "icon": "13430",
        "cooldown": {
          "base": "350s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "47.2%",
      "gameRate": "0.4%",
      "kdaScore": "5.9"
    }
  },
  {
    "id": "135",
    "name": "Thane",
    "title": "The Protector",
    "type": "tank",
    "hint": "Thane cannot be stopped once he starts his Valiant Charge, so use this to your advantage. King's Glory has a slight delay and not a very long range. It is best to unleash this ability when enemies are close.",
    "story": "Thane's name is seemingly written on the first page of every book on human history. Not only did he break the dark reign, but he was also the pioneer of technology. In a time when faith was scarce and demons ran amok, humans used technology to break away from being ruled by demons and became their own masters. From a refugee that could barely protect himself to a king that everyone admires, Thane has undergone arduous training, has seen dead bodies covering battlefields, has slain countless demons and has lost countless friends. But Thane never gave up, and he always led his troops through dark times, clinging onto glimpses of hope when there was almost none. On the day of his ascension to the throne, he earned enormous respect from his people. Even though the Temple was wary of his rise, and dubious politics overshadowed the capital, people still believed that Thane would be the one to lead them to a bright and peaceful future. That's why Valhein, The Demon Hunter, brought his people from afar and swore fealty to Thane. That's why Astrid, The Indomitable, risked the honor of her family and cleared the way for Thane to become king. That's why Raz, The Fist, became a spy and formed the resistance in an enemy camp. Human fighters have decided to stop fighting against each other and unite under Thane, combining their strengths to create a tidal wave that will push history forward and drive the demons back to their abyss. When a savage beast learns self-control, even gods should be afraid. Throughout all of this, Thane has kept his head cool, because when the horn of war is blown, he will lead the charge. With this sword in my hand, I will vanquish all evil!",
    "poise": "60%",
    "ad": "60%",
    "ap": "50%",
    "difficulty": "20%",
    "stats": {
      "health": {
        "base": "3535",
        "grow": "380.2"
      },
      "attack": {
        "base": "157",
        "grow": "10.7"
      },
      "defense": {
        "base": "123",
        "grow": "26.5"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Royal Power",
        "description": "When Thane's HP falls below 30%, he regenerates 24% of his maximum HP over 6 seconds. 75-second cooldown.",
        "icon": "13500",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Valiant Charge",
        "description": "Thane charges forward, knocking enemies back and dealing 60 (+54) physical damage each hit. Valiant Charge's final hit will also knock enemies into the air.",
        "icon": "13510",
        "cooldown": {
          "base": "120s",
          "grow": "-8s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "5"
        }
      },
      {
        "name": "Avalon's Fury",
        "description": "Thane strikes the ground, dealing 200 (+91) physical damage to enemies within range. He also knocks enemies into the air and slows their movement speed by 90% for 2 seconds.",
        "icon": "13520",
        "cooldown": {
          "base": "85s",
          "grow": "-5s"
        },
        "energy": {
          "type": "mana",
          "base": "75",
          "grow": "5"
        }
      },
      {
        "name": "King's Glory",
        "description": "Thane charges for a short time, then unleashes a powerful blow in a frontal cone, dealing 500 (+141) true damage to enemies in the area. The blow also deals 15% of the targets' lost HP as physical damage. Thane gains 20% damage reduction and cannot be interrupted while charging this ability.",
        "icon": "13530",
        "cooldown": {
          "base": "400s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "150",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "50.5%",
      "gameRate": "2.6%",
      "kdaScore": "6.3"
    }
  },
  {
    "id": "136",
    "name": "Ilumia",
    "title": "The Seer",
    "type": "mage",
    "hint": "Use Divine Light and Banish together to trigger Ilumia's passive. It will allow her to chain her attacks. Follow this up with Cataclysm to keep up the offense. In a team fight, save Cataclysm for finishing.",
    "story": "Ilumia had it all: beauty, intelligence, power, glory, and strength. Just as Maloch represented the dark power, Ilumia was the embodiment of light. No hero was above Ilumia. She never showed anyone her true self because she had a more important identity to assume: Goddess of Light. Her elegance, purity, and magic compelled people to believe that Ilumia was the Goddess that brought hope and light to the people. The Temple was founded and expanded on these beliefs. With a revered Goddess, the Temple firmly established the religion, which commanded its fearless followers to resist dark invasions. As the actual power wielder of the Temple, Ilumia knew how to play the game. She managed to wrestle the Temple free from the castle's rule and protect her followers' interests when Thane's power reached its pinnacle. Ilumia lived and breathed power, and she would never give it up willingly.",
    "poise": "20%",
    "ad": "30%",
    "ap": "100%",
    "difficulty": "80%",
    "stats": {
      "health": {
        "base": "2860",
        "grow": "155.5"
      },
      "attack": {
        "base": "173",
        "grow": "8.9"
      },
      "defense": {
        "base": "95",
        "grow": "18.1"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Purify",
        "description": "Removes all debuffs and control effects on yourself and gains immunity to them for 1.5 seconds.",
        "icon": "80107",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Goddess",
        "description": "Using any 2 abilities will strengthen the next Divine Light cast within 3 seconds and refreshes its cooldown immediately.",
        "icon": "13600",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Divine Light",
        "description": "Ilumia fires a divine light in the specified direction, which explodes upon contact with enemies in range and deals 280 (+0) magic damage. The divine light deals double damage and knocks enemies back when it is enhanced by Ilumia's passive.",
        "icon": "13610",
        "cooldown": {
          "base": "30s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "40",
          "grow": "5"
        }
      },
      {
        "name": "Banish",
        "description": "Ilumia knocks back enemies in range using Banish, dealing 190 (+0) magic damage.",
        "icon": "13620",
        "cooldown": {
          "base": "100s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "5"
        }
      },
      {
        "name": "Cataclysm",
        "description": "Ilumia summons a divine matrix that explodes after a short delay below all enemy heroes, dealing 640 (+0) magic damage to the heroes and nearby enemies as well as stunning them.",
        "icon": "13630",
        "cooldown": {
          "base": "600s",
          "grow": "-100s"
        },
        "energy": {
          "type": "mana",
          "base": "90",
          "grow": "30"
        }
      }
    ],
    "history": {
      "winRate": "52.9%",
      "gameRate": "0.3%",
      "kdaScore": "7.0"
    }
  },
  {
    "id": "139",
    "name": "Kil'Groth",
    "title": "The Terror",
    "type": "warrior",
    "hint": "Kil'Groth's Gore Lord removes control effects and makes Kill'Groth temporarily immune to them, so remember to activate this ability when an enemy is trying to control you. Target enemy heroes when you use Sea Spear so the cooldown is reduced.",
    "story": "The blood red sea roiled and boiled with fury. Kil'Groth was the ruler of the seas, where rage served as the only way to survive. Survival of the fittest was the normal natural order, but Kil'Groth's fanaticism stemmed from a complete disregard for balance in the food chain. The only thing he cared about was instilling the fury of killing in all sea creatures. As for what they killed, well, that was up to them. Relentless slaughter served as the source of power of Kil'Groth's rage. Fresh blood diffusing into the seas aroused swarms upon swarms of deep sea predators which then filled the gaps left in the food chain. Such intense rage power was intoxicating for the demons. Taara, commander of the Fallen, wielded her hammer like the coming of a cyclone. She used the power of absolute zero ice to freeze the ocean surface. The water, which was heated by fresh blood, cooled and even Kil'Groth felt the effects. His pride, however, did not allow him to flee a fight. His raging will blazed and freed Kil'Groth from his icy confines. He picked up his massive sea blade and began his last charge towards the intruder. Many hundreds died at Kil'Groth's hands, but, under the command of Taara, the flood of the Fallen drowned him like a massive tidal wave. When the bloody battle ended, the dying Kil'Groth lacked the strength to even hold his weapon. In fact, if Cresht hadn't led the beast army to the rescue, Kil'Groth may have died there and become a legend in his own right. However, Kil'Groth recovered from his wounds and ended up joining the Forest of Shadows array to show his gratitude as well as exact revenge. The furious Kil'Groth refused to follow orders from anyone. If any of the Fallen dared to insult him, his rage would finish them in an instant.",
    "poise": "50%",
    "ad": "80%",
    "ap": "40%",
    "difficulty": "20%",
    "stats": {
      "health": {
        "base": "3370",
        "grow": "270.4"
      },
      "attack": {
        "base": "168",
        "grow": "11.5"
      },
      "defense": {
        "base": "100",
        "grow": "22.1"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "The Fanatic",
        "description": "Each normal attack increases Kil'Groth's attack speed by 4-8% (scales with hero level), stacks up to 8 times. Kil'Groth's 3rd normal attack has a longer attack range.",
        "icon": "13900",
        "cooldown": {
          "base": "8s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Sea Spear",
        "description": "Kil'Groth charges forward, dealing 100 (+109) physical damage to enemies along the path and slowing their movement speed by 25% for 1.5 seconds. The cooldown is reduced by 4 seconds when it hits enemy heroes.",
        "icon": "13910",
        "cooldown": {
          "base": "135s",
          "grow": "-5s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "8"
        }
      },
      {
        "name": "Enraged Spear",
        "description": "After learning this ability, Kil'Groth's 3rd normal attack will deal an additional 25 (+42) magic damage.\n\nWhen the ability is activated, every normal attack in the next 4 seconds also deals the same additional magic damage. For each target Kil'Groth hits, his HP restores by 20 (+16). Kil'Groth can hit more than 3 enemies, but will only restore HP up to 3 times per attack. HP also restores by 150% when Kil'Groth's HP is less than 50%.",
        "icon": "13920",
        "cooldown": {
          "base": "145s",
          "grow": "-5s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Gore Lord",
        "description": "Kil'Groth immediately gains 4 stacks of Fanatic, removing all control effects for the next 6 seconds. Also, his movement speed is increased by 80% for a short period.",
        "icon": "13930",
        "cooldown": {
          "base": "350s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "10"
        }
      }
    ],
    "history": {
      "winRate": "47.7%",
      "gameRate": "0.1%",
      "kdaScore": "6.1"
    }
  },
  {
    "id": "140",
    "name": "Superman",
    "title": "The Man of Steel",
    "type": "warrior",
    "hint": "As long as Superman keeps moving, even if he wanders in circles, he will be able to enter Flight mode. Strike your enemies with Man of Steel while in Flight mode to fly over obstacles. The damage from Kryptonian Strength while in Flight mode can be devastating, but the target area is not very big, so use it when the enemy is very close.",
    "story": "On the dying planet of Krypton, an infant named Kal-El was placed inside of a rocket and sent to the distant planet Earth. The last alien survivor, Kal-El was raised by farmers-Martha and Jonathan Kent-who named their son Clark and infused in him the strong moral values that would give birth to the hero known as Superman. As he grew from a boy to a teen, and then into a man, the radiation from Earth's yellow sun allowed him to manifest incredible abilities, including superhuman strength, speed, and invulnerability. He also possesses the power of flight, as well as X-ray, heat, microscopic, and telescopic vision. Yet, along with his tireless desire to help the people of Earth escape calamity and reach their highest potential, came a sense of isolation.  Though he calls Earth his home, he is not of this world. The knowledge that his true home, the planet Krypton, is but stardust and solar debris, has kept Superman from venturing too far from Earth.  That all changed on a fateful autumn day, when Superman encountered one of his greatest foes. The villain Brainiac, supercharged with power from an unknown source, descended upon Earth with a fleet of advanced robotic drones. It took every last ounce of Superman's power to defeat Brainiac. The Man of Steel's endurance won out, and before dispatching Brainiac, his X-ray vision spotted something with a bright, glowing aura. Superman removed the glittering gem from Brainiac's armor and felt a surge of power ripple through his hand and up his spine. Immediately distrustful of the object's incredible power, Superman retreated to the Fortress of Solitude to analyze the rare artifact.  The Fortress of Solitude's computer could find no analog for the artifact's substance anywhere in the galaxy. However, there was one clue that the artifact found: a log from Kryptonian scientist Jor-El—Kal-El's father. Superman discovered that his father had been researching a similar artifact, which had been called an Andura Shard. This object, which could have given Brainiac the key to domination of the entire Earth, was only one piece of a much larger whole! The Andura Shard originated in a realm called Athanor, a place beyond even the Phantom Zone. Mainstream Kryptonian scientists had scoffed at Jor-El's assertion of the fact that parallel dimensions existed, and his boldest claim, that the magic which emanated from Athanor was linked to the physical universe, nearly brought him professional ruin.  But Jor-El was right. As Superman eagerly combed through the Fortress of Solitude's archives, he learned that ancient Kryptonians had explored the galaxy in search of the Andura Shards, and may have even visited the Earth long ago as part of their quest. But as Superman searched the Fortress of Solitude, it was revealed that Brainiac had redoubled his search for the Andura Shards and, if he claimed this ultimate source of their power, all of Earth would be in danger. Superman has already lost one world: he refuses to lose another. So the Man of Steel has taken flight across the galaxy in search of Athanor and the Andura Shards. On his quest to fulfill the legacy of his father, he will find himself cast as the defender of a new realm in desperate need of truth and justice.",
    "poise": "80%",
    "ad": "50%",
    "ap": "60%",
    "difficulty": "70%",
    "stats": {
      "health": {
        "base": "3322",
        "grow": "270.4"
      },
      "attack": {
        "base": "170",
        "grow": "12.4"
      },
      "defense": {
        "base": "101",
        "grow": "20.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Flight",
        "description": "Superman has two modes: flying and walking. He gains 2% movement speed and charges energy for every 100 units he walks, and takes flight once energy is fully charged. Flight mode grants 20% movement speed when moving towards an enemy, and his normal attacks deal additional physical damage equal to 12% of his own maximum HP. Superman exits Flight mode when he is hit with a control effect that lowers his movement speed to 375 or less.",
        "icon": "14000",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Kryptonian Strength",
        "description": "Superman uses his ice breath to generate a blizzard that deals 250 (+255) physical damage to enemies and slows their movement speed by 50% for 1 second.\n\nIf in Flight mode, Superman rams into enemies, dealing 170 (+398) (12% of maximum HP) physical damage, and then fires his heat vision, dealing an additional 250 (+255) physical damage.",
        "icon": "14010",
        "cooldown": {
          "base": "80s",
          "grow": "-8s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Man of Steel",
        "description": "Superman unleashes his full power, which immediately frees him from control effects and significantly increases his movement speed. \n\nIf in Flight mode, Superman will slam the ground and knock back enemies, dealing 335 (+191) physical damage as well as rid himself of control effects and increase his movement speed.",
        "icon": "14020",
        "cooldown": {
          "base": "120s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Speeding Bullet",
        "description": "Superman taps into his full potential, which increases his charge up speed by 100% for 10 seconds.\n\nIf in Flight mode, Superman will ram into his enemies and knock them back, dealing 170 (+398) (12% of maximum HP) physical damage, and have his charge up speed increased by 100% for 10 seconds.",
        "icon": "14030",
        "cooldown": {
          "base": "600s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "49.0%",
      "gameRate": "1.9%",
      "kdaScore": "6.5"
    }
  },
  {
    "id": "141",
    "name": "Lauriel",
    "title": "The Archangel",
    "type": "mage",
    "hint": "Lauriel's Smite allows her to keep using other abilities in rapid succession. This is extremely valuable and can keep her safe. Make sure Blink hits an enemy when you unleash it to reduce its cooldown.",
    "story": "Above the Heavens, she stands beside the throne of the Great Ones. Lauriel spreads her six majestic wings and soars. Lauriel was the guardian of the Temple of Light and the spiritual leader of its followers. Devoted to her task, she kept an endless vigil within the Temple directing her power against the encroachment of darkness. She devoutly obeyed the words of the Great Ones and was thereby imbued with their almighty power. She was their herald, spreading  truth to the Great One's followers, in whose eyes, she was the embodiment of their Grace and Righteousness. The sincerity of Lauriel's belief gave her unrivaled power and, for a while, wielded control over reincarnation itself. During that time, the rebirth, resurrection, and guidance of souls through reincarnation were all under Lauriel's control. The flapping of her wings would bring new life into being, while the closing of her wings would throw life into yet another cycle of toil. While doing battle with the army of the Fallen, the followers once witnessed Lauriel spreading her wings and charging the enemy ranks. The lightning she summoned arched and sliced through the demonic horde in a single blow. The forces under her command were then fearless in their mission of vanquishing the army of the Fallen. I will blow the horn of judgment at the end of days!",
    "poise": "10%",
    "ad": "20%",
    "ap": "100%",
    "difficulty": "80%",
    "stats": {
      "health": {
        "base": "3019",
        "grow": "185.2"
      },
      "attack": {
        "base": "167",
        "grow": "8.6"
      },
      "defense": {
        "base": "87",
        "grow": "17.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Divine Punishment",
        "description": "Enemies hit by Lauriel's abilities become marked. Every 4 marks trigger an explosion that deals 160 (+0) true damage to nearby enemies and slows their movement speed by 90% for 1 second. Lauriel also recovers 110 HP after the explosion.",
        "icon": "14100",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "The Wheel",
        "description": "Lauriel summons the divine light, dealing 215 (+0) magic damage to enemies. The path lights up shortly after and deals the same amount of magic damage again.",
        "icon": "14110",
        "cooldown": {
          "base": "50s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "5"
        }
      },
      {
        "name": "Blink",
        "description": "Lauriel charges towards the target direction and summons 3 energy orbs to attack nearby enemies, dealing 175 (+0) magic damage with each attack. Ability cooldown is reduced by 4 seconds when it hits enemies.",
        "icon": "14120",
        "cooldown": {
          "base": "100s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "5"
        }
      },
      {
        "name": "Smite",
        "description": "Lauriel summons a Judgment Circle that lasts 12 seconds, dealing 210 (+0) magic damage both when the circle appears and fades. Also, reduces the cooldown of The Wheel and Blink when she is in the circle.",
        "icon": "14130",
        "cooldown": {
          "base": "400s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      }
    ],
    "history": {
      "winRate": "51.4%",
      "gameRate": "1.9%",
      "kdaScore": "7.2"
    }
  },
  {
    "id": "142",
    "name": "Natalya",
    "title": "The Nether Queen",
    "type": "mage",
    "hint": "Use Natalya's abilities in quick succession so that her passive ability's effects will be maximized and deal the most damage.",
    "story": "When the Fallen invaded, a group of devout followers at the Temple of Light willingly submitted themselves to Poison Fang, a parasite, becoming immortal warriors to protect their sacred ground from the Fallen while bearing the eternal and wicked curse.  The hosts of Poison Fang cannot be killed, and the parasite can be passed onto offspring through generations. Natalya, a descendant of these warriors, also carried the parasite. When one of the tribe fell to insanity caused by the overwhelming power, the warrior was devoured, and his strength was absorbed by the rest of the tribe. To fight the external threats, the Temple quarantined the tribe to breed stronger hosts. Natalya happened to be the best descendant the Temple had seen in years. To appease her, the Temple even sent an emissary with extravagant gifts to her coming-of-age ceremony. What they did not know was that Natalya had grown tired of the humiliating quarantine and did not want to see her tribe falling insane. I will bear all the sins! She devoured her entire tribe during the ceremony to end their cursed destiny. With her head held high, Natalya showed her determination to break away from the Temple, for she knew very well that the root of the curse was the ambitious Temple. Natalya faded into darkness and managed to split from the Poison Fang with curses from the same school of magic. In exchange, she swore allegiance to Veera. With Poison Fang by her side as a loyal pet, Natalya held the power to rain destruction in her wake.",
    "poise": "10%",
    "ad": "50%",
    "ap": "80%",
    "difficulty": "40%",
    "stats": {
      "health": {
        "base": "3323",
        "grow": "190.8"
      },
      "attack": {
        "base": "170",
        "grow": "8.8"
      },
      "defense": {
        "base": "83",
        "grow": "16.6"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Arcane Fire",
        "description": "Abilities deal additional damage to enemies and can be stacked up to 10 times within a short time.",
        "icon": "14200",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Arcane Spirits",
        "description": "Natalya fires 5 arcane spirits towards the target area. Each spirit deals 350 (+0) magic damage to enemies within. When an enemy is hit by multiple spirits, each additional spirit only deals 30% damage. Spirits stop traveling when they hit an enemy hero.",
        "icon": "14210",
        "cooldown": {
          "base": "60s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Arcane Nova",
        "description": "Natalya casts an Arcane Orb towards the specified direction. When the orb touches an enemy or reaches the end of its path, it becomes an Arcane Nova and stuns enemies hit for 1 second. Then the orb grows in size and flies slowly to deal 130 (+0) magic damage each time it comes into contact with an enemy, reducing their movement speed by 50% for 1.5 seconds.",
        "icon": "14220",
        "cooldown": {
          "base": "100s",
          "grow": "-4s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      },
      {
        "name": "Lethal Rays",
        "description": "Natalya commands Poison Fang to release lethal rays, dealing 120 (+0) magic damage every 0.25 seconds to enemies. While channeling, Natalya gains a shield that absorbs 500 (+0) damage. Natalya is immune to crowd control effects while the shield lasts. This ability must be channeled and has a maximum duration of 3.5 seconds. Channeling can be canceled after 1 second by using the ability again.",
        "icon": "14230",
        "cooldown": {
          "base": "300s",
          "grow": "-40s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "20"
        }
      }
    ],
    "history": {
      "winRate": "48.8%",
      "gameRate": "1.9%",
      "kdaScore": "6.8"
    }
  },
  {
    "id": "144",
    "name": "Taara",
    "title": "The War Hammer",
    "type": "tank",
    "hint": "When Taara's HP is low, her attack damage increases dramatically. Avoid using Steeled Focus when she has full HP as it does not take full advantage of the HP regeneration effects. Taara can leap over walls and other obstacles with Colossal Smash, so you can use this to surprise enemies.",
    "story": "The Iron Mountain Range laid at the northern tip of the land, surrounding the Holy Hall like an iron wall. This renowned mountain range was known for its deposits of metal ore, which served as the main source of income for the Holy Hall.  As a group of people indigenous to the region, the Holy Hall directly governs over all of their faithful followers. The tribe led by Taara achieved many feats in the warring era. Though they lack the necessary crafting skills for fine weapons, they held their crudely-made hammers in valiance and smashed down on the invading Fallen at the foot of the mountains. Bloodbath after bloodbath, Taara's tribe paid dearly. However, even on the verge of losing the entire Iron Mountain Range, surrender never entered Taara's mind. On the day of the resurgence of light, Taara and her tribesmen held a great festival. They lit the furnace deep in the mountains and celebrated with pillars of raging flames. Thane's messengers came at this time, announcing the order of the new king; due to Taara's valiance in the war, she was conferred a noble title. This meant she now owned a wealthy piece of land in the new kingdom and her tribe was finally able to escape the life of material shortages and hard mining work. However, before Taara could plan her transition, Gildur's fury had spread to the Iron Mountains. As the Holy Hall's financial officer, Gildur knew that population meant production capacity, and he would not allow Thane to destabilize the cornerstones of the Order. Thane's messenger was exiled, and Taara was regarded as a traitor to the faith and imprisoned. In addition, the taxes for her tribe would be doubled for the next ten years as a punishment. Having the ground collapse beneath her, she fell from heaven straight into hell and endless torment. Veera, who had been spying from the dark, seized the chance to rescue Taara, leaving her with these words: False gods fail you in light; why not embrace true darkness? Disappointed by the Holy Hall, Taara submitted herself to the abyss. She was willing to be baptized by frost fire, and commit her soul to a dark will. I rely only on the power I can hold in my hands!",
    "poise": "50%",
    "ad": "60%",
    "ap": "50%",
    "difficulty": "20%",
    "stats": {
      "health": {
        "base": "3370",
        "grow": "278.3"
      },
      "attack": {
        "base": "173",
        "grow": "10.6"
      },
      "defense": {
        "base": "100",
        "grow": "22.1"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      },
      {
        "name": "Purify",
        "description": "Removes all debuffs and control effects on yourself and gains immunity to them for 1.5 seconds.",
        "icon": "80107",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Fighting Spirit",
        "description": "Gains 2-5 attack damage for every 1% of HP lost. Scales with level.",
        "icon": "14400",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Colossal Smash",
        "description": "Taara leaps into the air and smashes the ground with her hammer, dealing 120 (+86) physical damage to enemies within range and slowing their movement speed by 30% for 2 seconds.",
        "icon": "14410",
        "cooldown": {
          "base": "120s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Whirlwind",
        "description": "Taara swings her hammer in circles, dealing 150 (+95) physical damage twice to each enemy within range.",
        "icon": "14420",
        "cooldown": {
          "base": "50s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Steeled Focus",
        "description": "Taara unleashes her potential, regenerating 8% of HP every second for 5 seconds and increasing her movement speed by 30%.",
        "icon": "14430",
        "cooldown": {
          "base": "400s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "49.3%",
      "gameRate": "1.0%",
      "kdaScore": "6.5"
    }
  },
  {
    "id": "146",
    "name": "Zill",
    "title": "The Tempest",
    "type": "mage",
    "hint": "Zill is able to avoid damage from abilities when using Tornado, so use it at opportune moments. Make sure you attack enemy heroes again after marking them 3 times as normal attacks trigger additional damage when a target has 3 marks.",
    "story": "The roar of the storm signals your demise! History tells of many heroes who broke free of the constraints of gravity and flew through the air. However, none of them were ever able to attain the free, unfettered flight of a bird. The reason for this is Zill, a lethal danger hidden in the seemingly peaceful skies. The embodiment of the wind element, Zill can not only conjure devastating storms, but can also form the wind into razor-sharp blades that tear through even the toughest of enemy defenses. In the great war, Zill slaughtered dozens of marauding demons, earning him fame and admiration throughout the land. His remarkable martial exploits brought him status and influence. However, no one could understand why he refused the title of Guardian of the Forest of Shadows. He simply stated that the trappings of glory are incompatible with his free-spirited nature. When you need me, I will sever the heads of your enemies, tear them limb from limb, and drink their blood. But the free wind should never be shackled. That was the explanation he gave to Queen Tel'Annas. His unwavering loyalty and selflessness won the Queen's respect and trust. Before entering her slumber, she awarded Zill the right to exercise free will. Although this did not require him to undertake any specific duties, it allowed him complete access to the collective resources of the Forest of Shadows. Following this episode, Zill gradually faded from the public's attention. Other than the fairy Krixi who occasionally sensed his presence, no one else saw any trace of him. For a time, people completely forgot all about the hero who ruled the skies in the days of old. However, on the day of the Queen's awakening, Zill was the first to return to her side. For a thousand long years, Zill had given up the freedom he so desired to keep a silent vigil over the slumbering Tel'Annas. This was his way of repaying the unconditional trust she had placed in him. My blades will cut through any obstacle!",
    "poise": "10%",
    "ad": "40%",
    "ap": "100%",
    "difficulty": "80%",
    "stats": {
      "health": {
        "base": "3021",
        "grow": "256"
      },
      "attack": {
        "base": "163",
        "grow": "13.2"
      },
      "defense": {
        "base": "102",
        "grow": "19.5"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Dustdevil",
        "description": "Zill's abilities place Marks of the Wind on their targets when dealing damage. At 3 stacks, enemy movement speed is reduced by 80% for 0.25 seconds. Marks will last for 5 seconds.\n\nWhen Zill's normal attacks deal damage to targets with 3 marks, Wind Shift's cooldown is immediately refreshed, and the targets take an additional 150 (+0) magic damage.\n\nZill's normal attacks deal additional 40 magic damage.",
        "icon": "14600",
        "cooldown": {
          "base": "8s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Wind Blade",
        "description": "Zill tosses his scythes forward, dealing 200 (+0) magic damage to all enemies in their paths and reducing their movement speed by 50% for 0 seconds.\n\nThe scythes then fly back to Zill and deal 300 (+0) magic damage to all enemies in their paths.",
        "icon": "14610",
        "cooldown": {
          "base": "80s",
          "grow": "-5s"
        },
        "energy": {
          "type": "mana",
          "base": "65",
          "grow": "5"
        }
      },
      {
        "name": "Wind Shift",
        "description": "Zill blinks to the target location and deals 260 (+0) magic damage to nearby enemies.",
        "icon": "14620",
        "cooldown": {
          "base": "125s",
          "grow": "-5s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "10"
        }
      },
      {
        "name": "Tornado",
        "description": "Zill turns into a tornado for 1.5 seconds and attacks nearby enemies 5 times, dealing 300 (+0) magic damage each hit. Once a target is hit, subsequent hits only deal 40% damage. Zill cannot be targeted or attacked while in tornado form.",
        "icon": "14630",
        "cooldown": {
          "base": "500s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "20"
        }
      }
    ],
    "history": {
      "winRate": "48.4%",
      "gameRate": "1.4%",
      "kdaScore": "6.9"
    }
  },
  {
    "id": "148",
    "name": "Preyta",
    "title": "The Illest",
    "type": "mage",
    "hint": "Before entering a team fight, use Plague Specter to lower enemies' HP. Follow this up with Disciple of the Plague, so that you can increase Preyta's damage output and use Plague Specter again immediately.",
    "story": "Tremble, for I am the Plague, the Avatar of Pestilence. Born from battle, Preyta lived to spread disease and pestilence. During an ancient conflict between forgotten kingdoms, bodies began to pile high. Without time for proper burials, the dead were rolled into a deep ravine to fester and decay.  Preyta was the soldier tasked with guarding this area. However, as the corpse pile grew, the perpetual rot and festering corpses grew into something more. Preyta's soul became infected, his mind warped and twisted until all that remained was a servant of the plague. Empowered by the rot, a new creature was born. All living things were susceptible to the plague and Preyta knew just how well and quickly it could spread in time of war. Bards told tales of battlefields decimated by the purveyor of pestilence. He could appear anytime, on any battlefield, and rain down a putrid virus capable of consuming all life. Preyta could cause even the bravest of souls to cower in fear. Drawing powerful magic from pestilence, he could obliterate any shred of willpower that his enemy could muster before infecting them with a deadly pathogen.  He is the scourge, and he has returned to this world.",
    "poise": "20%",
    "ad": "40%",
    "ap": "110%",
    "difficulty": "40%",
    "stats": {
      "health": {
        "base": "2958",
        "grow": "174.4"
      },
      "attack": {
        "base": "168",
        "grow": "10.7"
      },
      "defense": {
        "base": "106",
        "grow": "16.9"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Flying Dragon",
        "description": "The Plague Wyvern boosts Preyta's movement speed.",
        "icon": "14800",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Plague Specter",
        "description": "Preyta charges his Plague Specter for up to 2 seconds, then unleashes it and deals 360 (+0) magic damage for each second spent channeling. Any command while charging will unleash the Specter immediately to deal reduced damage. In the Disciple of the Plague state, movement is possible while charging.",
        "icon": "14810",
        "cooldown": {
          "base": "60s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      },
      {
        "name": "Poison Gas Bomb",
        "description": "Preyta detonates a Poison Bomb at the target location, knocking back surrounding enemies, dealing 250 (+0) magic damage and reducing their movement speed by 50% for 2 seconds. In the Disciple of the Plague state, the Poison Bomb is replaced by nether spikes and they also stun the targets for 1 second.",
        "icon": "14820",
        "cooldown": {
          "base": "140s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "5"
        }
      },
      {
        "name": "Disciple of the Plague",
        "description": "Preyta fuses with the Wyvern Spirit and enters the Disciple of the Plague state for 10 seconds, immediately refreshing the cooldowns of Plague Specter and Poison Gas Bomb and enhancing their effects on their next use. While in this state, Preyta also receives a shield that absorbs 500 (+0) damage, gains 15% movement speed, and 10% attack speed. His normal attack's range is also significantly increased and inflicts 80 (+0) area magic damage.",
        "icon": "14830",
        "cooldown": {
          "base": "450s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "130",
          "grow": "20"
        }
      }
    ],
    "history": {
      "winRate": "49.6%",
      "gameRate": "0.3%",
      "kdaScore": "6.7"
    }
  },
  {
    "id": "150",
    "name": "Nakroth",
    "title": "The Executioner's Blade",
    "type": "assassin",
    "hint": "When things are too hot, use Death Sentence to escape and position yourself for a counter attack. If Nakroth's other abilities are on cooldown, you can use Judgment's Blade to avoid enemies' control effects.",
    "story": "Your sins will be judged in the underworld. Nakroth served as the Arbiter of Souls to the underworld. Prince or pauper, sinner or saint, all must face his judgment before continuing their journey to the underworld. When Preyta opened the channel between the underworld and the continent, Nakroth joined Hell's Legions in invading the mortal realm. However, unlike the ruthless Fallen, the souls under his command were prohibited from killing prisoners and civilians under his strict code. For Nakroth, combat was the means to test his mettle against the most formidable adversaries available, not an excuse for unbridled slaughter. Of course, Nakroth's benevolence did not extend to the battlefield, where he inspired deep reverence in his enemies for his bravery and skill. No one would dare ignore Nakroth's presence. The blade he wields is the source of our nightmares. Although usually reserved, Nakroth couldn't help but give a faint smile upon hearing such words from his enemies. In life or in death, you will not escape me.",
    "poise": "30%",
    "ad": "60%",
    "ap": "80%",
    "difficulty": "80%",
    "stats": {
      "health": {
        "base": "2988",
        "grow": "190.5"
      },
      "attack": {
        "base": "172",
        "grow": "15.3"
      },
      "defense": {
        "base": "92",
        "grow": "16.5"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Dread Judge",
        "description": "Every 4th normal attack knocks the target into the air. Each time an ability hits an enemy, Nakroth gains 50% attack speed.",
        "icon": "15000",
        "cooldown": {
          "base": "8s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Jury Fury",
        "description": "Nakroth lunges forward and knocks the target into the air, dealing 135 (+106) physical damage. The ability can be used again within 5 seconds of first use before triggering the full cooldown.",
        "icon": "15010",
        "cooldown": {
          "base": "96s",
          "grow": "-8s"
        },
        "energy": {
          "type": "mana",
          "base": "55",
          "grow": "5"
        }
      },
      {
        "name": "Death Sentence",
        "description": "Nakroth flips backwards and the next normal attack within 3 seconds becomes a horizontal sweep that deals 180 (+172) physical damage.",
        "icon": "15020",
        "cooldown": {
          "base": "50s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "55",
          "grow": "5"
        }
      },
      {
        "name": "Judgment's Blade",
        "description": "Nakroth swings his blades against enemies in range, dealing 130 (+107) physical damage each hit, with the last hit knocking enemies into the air. He is immune to control effects for the duration of this ability.",
        "icon": "15030",
        "cooldown": {
          "base": "360s",
          "grow": "-60s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "25"
        }
      }
    ],
    "history": {
      "winRate": "43.5%",
      "gameRate": "0.5%",
      "kdaScore": "5.9"
    }
  },
  {
    "id": "152",
    "name": "Diaochan",
    "title": "The Crystal Lotus",
    "type": "mage",
    "hint": "Diaochan can slow enemies down with Chilling Frost. Use this ability first, then follow up with Diamond Dust to freeze your enemy, allowing you to deal further damage and take them out.",
    "story": "Men may think they rule the world, but I rule men.  Diaochan said this at the tender age of 18. She had just learned the art of Sleeve Dancing and with it, she had already managed to seduce all the men who frequented Chang'an Avenue. An old official claimed: This girl must be the incarnation of heavenly sin! before falling at her feet, eager to catch the fragrance of her dress.  Even the mighty Lu Bu could not resist Diaochan's beauty. When she frowned, Lu Bu was ready to slay his own godfather, Dong Zhuo, for unintentionally offending this beauty with his glance. The very sight of Diaochan's sad face was enough for Lu Bu to kill.  Diaochan was indeed beautiful, but her beauty was matched by her manipulative nature. Heroes all over the world came to challenge Lu Bu to become Diaochan's new champion. Most of them were killed with a single strike. In fear, some banded together and yet met the same fate. Seeing his enemies multiply and Lu Bu's thirst for battle grow, Diaochan quietly left the man who loved her so deeply on one stormy morning.  Try not to think of me too much.",
    "poise": "20%",
    "ad": "30%",
    "ap": "100%",
    "difficulty": "80%",
    "stats": {
      "health": {
        "base": "3088",
        "grow": "202"
      },
      "attack": {
        "base": "165",
        "grow": "9.4"
      },
      "defense": {
        "base": "91",
        "grow": "15.3"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Ice Queen",
        "description": "Frozen enemies take an extra 155 magic damage.",
        "icon": "15200",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Chilling Frost",
        "description": "Diaochan attacks with frost, dealing 305 (+0) magic damage to enemies in the target area and slowing their movement speed by 50% for 2 seconds. She also places a mark on targets for 0 seconds. When marked targets are hit with Chilling Frost again, they become rooted for 1 second.",
        "icon": "15210",
        "cooldown": {
          "base": "50s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "65",
          "grow": "5"
        }
      },
      {
        "name": "Diamond Dust",
        "description": "After a short delay, Diaochan freezes and deals 288 (+0) magic damage to enemies within the target area. Frozen enemies take additional damage.",
        "icon": "15220",
        "cooldown": {
          "base": "80s",
          "grow": "-4s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "5"
        }
      },
      {
        "name": "Blizzard",
        "description": "Diaochan summons a blizzard, dealing 350 (+0) magic damage to enemies within the target area and slowing their movement speed by 30%. She also gains 600 armor. This ability must be channeled and has a maximum duration of 5.3 seconds. Moving or using another ability after 0.6 seconds of channeling will interrupt this ability.",
        "icon": "15230",
        "cooldown": {
          "base": "420s",
          "grow": "-70s"
        },
        "energy": {
          "type": "mana",
          "base": "150",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "48.5%",
      "gameRate": "1.5%",
      "kdaScore": "6.5"
    }
  },
  {
    "id": "153",
    "name": "Batman",
    "title": "The Dark Knight",
    "type": "assassin",
    "hint": "Use Batman's Dark Knight to get close to enemies, then look for protection opportunities from allies and mount a surprise attack. Activate Dark Knight again to deal a quick burst of damage. You can also activate Dark Knight while in the brush to prevent enemies from detecting Batman on the mini-map and escaping.",
    "story": "Batman has become a symbol of dark justice that hangs over Gotham City. Born into wealth as Bruce Wayne, he witnessed his parents murdered in front of him as a boy. This tragedy transformed his entire existence, reshaping him into the consummate crime-fighter.  Wayne traveled the world for a decade, training his mind and body relentlessly, pushing himself to the limits of human capacity, all in preparation of donning the mantle of the caped crusader. His years of tremendous effort have left him as not only the world's greatest detective, but with a physical prowess that has yet to be bested by any foe. As Batman, he has consistently been forced into battle in an array of alternate worlds, dimensions and universes. And it was through a bruising encounter with Zephys that Batman pieced together the existence of Athanor. Zephys collided into Earth, bringing with him a power of unimaginable magnitude. He had come to subdue the earth and build a new world. One that would be subjugated by Athanor and be forced to provide fresh troops for its eternal war. During the tumult, Batman found himself chasing Zephys, passing through countless worlds and fragments of time. Finally catching up to him, Batman sought to end Zephys' dark plot right then and there. However, he just could not find an opening to end the fight. Suddenly, the hero Valhein appeared, under orders from Thane, to investigate the strange rumblings of doom. With his aid, Batman finally beat back Zephys and temporarily banished him back to his realm. Traveler, welcome to Athanor, Valhein whispered in a deep, but urgent voice. Batman felt drawn towards this mysterious new land, to understand just what sort of role it would play in his destiny. Stepping into the light, he found himself in Thane's court. The resplendent king sat high above the rest as a gloomy pall hung over the room. He thanked the Dark Knight for subduing Zephys and handed him a shining gem, a fragment of Andura. Upon touching the gem, Batman experienced a vision of fire and despair. Gotham lay in ruins, consumed by flames that licked the air. Its inhabitants were being led towards the darkness in chains. The old and feeble were disposed of. The young and strong were ripped away from their loved ones and cowed. And above all of this sat a malevolent shadow that seemed to glow brighter than the very flames swallowing the city. Then, at a snap of its immaterial fingers, the light extinguished, and life existed no more. Batman stood unmoving, transfixed in the horror. This isn't real, is it? were his only words. This must be some sort of trick. However, the solemn shake of Thane's head and his mournful eyes, brought ice into the Dark Knight's veins. Thoughts raced through Bruce's mind. What is this madness? What is this despair? Thane finally spoke It is what will come to pass, if we sit idle. He continued, The Andura fragment you hold must be returned whole. It has the power to create, and a devastating power to destroy. It matters not where your world lies in time and space, all is connected to Athanor. And with that, Batman felt himself hurdled back to Gotham, to ponder upon the choices that lay ahead. Then with quiet and steeled determination, he fought. With Lucius and Alfred's aid, he modified his armaments to prepare himself for the coming battle. His friends worried for him. They were unsure of the threats lying in wait for Bruce. But as we all know from experience, never underestimate the Batman.",
    "poise": "20%",
    "ad": "110%",
    "ap": "40%",
    "difficulty": "60%",
    "stats": {
      "health": {
        "base": "3292",
        "grow": "210"
      },
      "attack": {
        "base": "171",
        "grow": "15.5"
      },
      "defense": {
        "base": "85",
        "grow": "18.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Caped Crusader",
        "description": "When Batman approaches an enemy hero, his movement speed increases by 20%.",
        "icon": "15300",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Forearm Strike",
        "description": "Batman attacks with his forearm blades and deals 215 (+145) physical damage to nearby enemies. One random enemy will take double damage.",
        "icon": "15310",
        "cooldown": {
          "base": "50s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "5"
        }
      },
      {
        "name": "Batarang",
        "description": "Batman launches an explosive Batarang that deals 165 (+97) physical damage to enemies and reduces their movement speed. The target will receive additional physical damage equal to 24% of their lost HP after 3 seconds. Enemies hit are stunned if attacked by Batman again, and Batman restores 140 (+85) HP.",
        "icon": "15320",
        "cooldown": {
          "base": "96s",
          "grow": "-8s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      },
      {
        "name": "Dark Knight",
        "description": "Batman conceals himself behind a colony of bats and becomes invisible after 1.5 seconds. Batman's invisibility lasts for 30 seconds unless he stays within 6 units of an enemy hero for more than 3 seconds. If the ability is used again while invisible, he will fly towards the target direction, dealing 660 (+321) physical damage to enemies in his path. He gains 50% attack speed for 5 seconds after coming out of invisibility.",
        "icon": "15330",
        "cooldown": {
          "base": "360s",
          "grow": "-60s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "51.1%",
      "gameRate": "0.9%",
      "kdaScore": "7.5"
    }
  },
  {
    "id": "156",
    "name": "Aleister",
    "title": "The Lord of Mischief",
    "type": "mage",
    "hint": "Aleister's Matrix of Woe does continuous damage for a decent amount of time. Trap enemies in the matrix by following up with Magic Prison and maximizing the damage received.",
    "story": "We might not be able to take care of the problem, but we can take care of the person who brought it up. People may have forgotten that Aleister, the infamous crook, was once a candidate for the Temple of Light. With Yorn the Hotshot, they were hailed as the Sons of Light at the time and had the most potential to be fully inducted into the Temple. Despite Aleister's intelligence, he didn't possess a strong will and he fell into the darkness due to Veera's charm. Though on a different note, Aleister's brilliance had a huge impact on the war. His endless tricks and traps helped the Fallen to defeat the resistance forces time after time. To eliminate the master think tank behind the dark power, Yorn left glory behind and led an elite team deep into enemy territory to assassinate Aleister. His near-perfect plan was foiled by Aleister, who turned the tables on him and nearly trapped him in the abyss forever. Are you smart enough to go up against me?",
    "poise": "20%",
    "ad": "30%",
    "ap": "100%",
    "difficulty": "80%",
    "stats": {
      "health": {
        "base": "3027",
        "grow": "198"
      },
      "attack": {
        "base": "170",
        "grow": "8.8"
      },
      "defense": {
        "base": "87",
        "grow": "16.7"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Wicked Plot",
        "description": "Aleister's abilities and every 3rd normal attack apply 1 Curse stack on the enemy. The Curse explodes at 3 stacks, dealing 130 (+0) true damage to the enemy.",
        "icon": "15600",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Magic Barrier",
        "description": "Aleister summons lightning and stops enemies from advancing. Enemies touched by lightning take 315 (+0) magic damage, are stunned and slowed, and receive 1 stack of Curse.",
        "icon": "15610",
        "cooldown": {
          "base": "140s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "5"
        }
      },
      {
        "name": "Matrix of Woe",
        "description": "Aleister summons a matrix at the target area, continuously dealing 100 (+0) magic damage to enemies within the area and applying 1 stack of Curse both when the matrix appears and disappears.",
        "icon": "15620",
        "cooldown": {
          "base": "100s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "5"
        }
      },
      {
        "name": "Magic Prison",
        "description": "Aleister traps an enemy hero in a lightning prison for 2.5 seconds, dealing 100 (+0) magic damage and stunning the enemy on each hit. The enemy gains 1 stack of Curse both at the beginning and the end. This ability must be channeled and has a maximum duration of 3 seconds. Moving or using another ability after 0.7 seconds of channeling will interrupt this ability.",
        "icon": "15630",
        "cooldown": {
          "base": "300s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "130",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "49.7%",
      "gameRate": "1.3%",
      "kdaScore": "6.4"
    }
  },
  {
    "id": "157",
    "name": "Raz",
    "title": "The Fist",
    "type": "mage",
    "hint": "When you're using Raz, try to plan out the best position in advance to avoid counterattacks. Hit enemies with a third consecutive normal attack to stun enemies before using a combo of his abilities.",
    "story": "Raz was an important figure in Thane's eternal struggle against the Corrupted. The magnificent king embedded Raz deep in the darkness to be his eyes and ears. Raz possessed superhuman speed and agility, most importantly his blinding fists struck fast and true. In his long mission, Raz won the trust of Preyta. Earning his favor, Raz was made head of a small strike team in Preyta's army. Using his authority and guile, Raz was always able to stay two steps ahead of the Corrupted, leveraging sabotage and subterfuge to impede the dark army. However, Preyta was no fool. He could smell a rat. He laid careful machinations to catch the traitor in his midst, even Raz was blissfully unaware until it was too late. While pursuing a false lead, he fell into Preyta's trap. He was immediately surrounded by an ocean of corrupted souls. Uttering foul curses, Preyta and his ilk closed in around Raz. He could sense that the end was near, but he could not just lay down and accept this kind of fate. Using his last bit of strength Raz lashed out with a fury never before seen in Athanor. His fists were on fire, lighting up his foes and his rage, until finally he broke through. However, his hands were badly broken and his spirit greatly wounded. Raz limped his way back into Thane's court where he collapsed onto the ground. To save his friend, Thane rushed Raz to the citadel and beseeched the angel Lauriel for aid. But in order to receive the Light's blessing, Raz would have to undergo a grueling trial, and if he failed, he would die. But luckily, he did not. Not only did Raz triumph and heal himself, he was stronger than he was even before. His gauntlets glowed a crimson light that grew steadily stronger as his resolve to vanquish the Corrupted grew ever more steeled. His fists would tear anything down that stood in the way of his righteous fury.",
    "poise": "30%",
    "ad": "40%",
    "ap": "90%",
    "difficulty": "90%",
    "stats": {
      "health": {
        "base": "3235",
        "grow": "198.5"
      },
      "attack": {
        "base": "170",
        "grow": "8.8"
      },
      "defense": {
        "base": "89",
        "grow": "17.7"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Fancy Footwork",
        "description": "Raz's footwork moves him closer to his enemies on his 2nd and 3rd consecutive normal attacks. The 3rd normal attack deals extra magic damage, knocks back enemies, and stuns them.",
        "icon": "15700",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Rising Uppercut",
        "description": "Raz unleashes a powerful uppercut that deals 480 (+0) magic damage to enemies within range and knocks enemies into the air. Restores 25 energy if the ability hits an enemy.",
        "icon": "15710",
        "cooldown": {
          "base": "100s",
          "grow": "-8s"
        },
        "energy": {
          "type": "energy",
          "base": "70",
          "grow": "0"
        }
      },
      {
        "name": "Power Surge",
        "description": "Raz launches a projectile from his fists that deals 440 (+0) magic damage to the first enemy it hits, briefly reducing their magic defense by 50 and movement speed by 60%. Restores 25 energy if the ability hits an enemy.",
        "icon": "15720",
        "cooldown": {
          "base": "40s",
          "grow": "-4s"
        },
        "energy": {
          "type": "energy",
          "base": "40",
          "grow": "0"
        }
      },
      {
        "name": "Explosive KO",
        "description": "Raz throws an extremely powerful punch, dealing 720 (+0) magic damage to enemies in its path and knocking them back. Restores 25 energy if the ability hits an enemy.",
        "icon": "15730",
        "cooldown": {
          "base": "250s",
          "grow": "-25s"
        },
        "energy": {
          "type": "energy",
          "base": "110",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "46.6%",
      "gameRate": "2.1%",
      "kdaScore": "6.0"
    }
  },
  {
    "id": "162",
    "name": "Kriknak",
    "title": "The Scarabim",
    "type": "assassin",
    "hint": "Use Kriknak's Terrifying Plague to put Marks of Horror on enemies to inflict increased amounts of damage on them and significantly reducing Terrifying Plague's cooldown.",
    "story": "A messenger of death who lurks amongst the souls. An assassin who is concealed in the shadows. It was difficult to say if Kriknak belonged to the living or the dead, because this being roamed freely amidst tombs, absorbing power by sucking out the essence of rotten souls, and yet it also had a body of flesh and its own soul. Of course, Kriknak was not concerned by matters such as life or death. The only thing it cared about was the orders from its master, Searcy the Banshee. As Searcy's devoted servant, there was nothing Kriknak was unwilling to do for its master. Even when it meant facing Claves Sancti in the hands of Thane himself, Kriknak stood strong in front of its master and used its proud horns to block any blow that came forth. These horns ended up being ruthlessly cleaved away by Thane, but Kriknak's loyalty was rewarded through Searcy's trust and gifts. Searcy, in turn, reluctantly pulled off her own horns to treat Kriknak's severely depleted energies, and transplanted them by infusing it with powerful spiritual energy. As the new horns took hold, the souls of Kriknak and Searcy converged completely. Even if they were separated by a thousand miles, Kriknak would always know what its master was thinking, and would spare no effort to complete any task it was assigned to.",
    "poise": "30%",
    "ad": "70%",
    "ap": "60%",
    "difficulty": "50%",
    "stats": {
      "health": {
        "base": "3239",
        "grow": "211.9"
      },
      "attack": {
        "base": "173",
        "grow": "15.2"
      },
      "defense": {
        "base": "86",
        "grow": "19.5"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Bite",
        "description": "When Kriknak's ability hits an enemy, the next normal attack will be enhanced and deal an additional 250 physical damage.",
        "icon": "16200",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Terrifying Plague",
        "description": "Kriknak summons a plague of larvae that deals 250 (+173) physical damage and inflicts the target with a Mark of Horror. When Kriknak attacks marked enemies, they take additional magic damage equal to 8% of maximum HP, the cooldown of this ability is reduced by 3 seconds, and restores 35 mana.",
        "icon": "16210",
        "cooldown": {
          "base": "100s",
          "grow": "-5s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "10"
        }
      },
      {
        "name": "Horn Rush",
        "description": "Kriknak lunges forward with his enormous horns, dealing 180 (+173) physical damage to enemies in his path. Every enemy hero hit restores 100 (+51) HP for Kriknak.",
        "icon": "16220",
        "cooldown": {
          "base": "60s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "5"
        }
      },
      {
        "name": "Drone Drop",
        "description": "Kriknak takes to the skies, significantly increasing his movement speed for 6 seconds. When casting this ability while airborne, Kriknak attacks the target area, dealing 400 (+276) physical damage to the enemies in the area and reducing their movement speed.",
        "icon": "16230",
        "cooldown": {
          "base": "120s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "47.6%",
      "gameRate": "0.4%",
      "kdaScore": "7.0"
    }
  },
  {
    "id": "163",
    "name": "Ryoma",
    "title": "The Ronin",
    "type": "warrior",
    "hint": "Keep a distance between Ryoma and his enemies to fully exploit his damage output. If you find yourself too close to your enemies use Pinwheel to open some space.",
    "story": "Don't dwell on the past. Instead, focus on the future. Ryoma's father's last words became his motto. As the heir of a samurai, Ryoma not only trained hard, he also studied military strategy. In a training camp where strength was valued above all else, he stood out among his peers. The other children had suffered the same fate as Ryoma: their fathers slain, it fell to them to pick up the mantle and earn glory for their families. Ryoma was timid when he was young. This, combined with his peculiar hobby of studying military tactics, made him an easy target for bullies. But Kondo always stood up for him. Kondo had studied under Ryoma's father and wanted to repay the kindness that his family had shown him. With Kondo as his guide, Ryoma became a samurai like his father. Their friendship did not last forever, as orders from the military sent them on diverging paths. The courageous Kondo was chosen to become the personal guard of the kingdom's heir apparent, while one of the younger princes chose Ryoma for his cunning. Once fiercely loyal friends, they were now rivals serving their princes. Ryoma would never have guessed that they would eventually become enemies. After some time, the aging king passed away while dealing with enemies outside of the kingdom. The princes, both well-trained in the ways of the court, quickly turned on one another. Ryoma, now the chief military strategist for the younger prince, swiftly led the prince's army to several decisive victories. The elder prince, running out of options, concocted a dangerous plan to send Kondo's death squad to assassinate the younger prince.  The plan appeared to be successful as the squad reached the younger prince's throne without any resistance. Ryoma had anticipated this move from the elder prince, but was shocked to see Kondo and hesitated. Kondo and his squad took advantage of the momentary lapse and sliced through Ryoma's defenses effortlessly. By the time Ryoma regained his focus, he could hear his prince's screams as his father's words reverberated in his mind. There was no need to hold onto the past, and at that moment, he decided to give everything he had. Sword in hand, Ryoma sliced through every single soldier that dared come near the prince. It was Kondo's turn to be surprised, but he had no choice but to press on. Kondo's attacks became sharper and more deadly as he taunted Ryoma. The duel ended when both launched one final attack. Ryoma buried his sword into Kondo's chest, but Kondo's blade had stopped at the last second, inches from Ryoma's throat. Why? Ryoma was confused. I was always an orphan, said Kondo, I never had anyone other than you and my teacher. He'd be proud of y… Before Kondo could finish his sentence, Ryoma burst into tears. After burying Kondo, Ryoma snapped his blade in half and buried it with Kondo. He vowed to never again use his right hand, the hand that killed Kondo. He picked up Kondo's naginata and walked away. Glory and honor? The samurai code? That's none of my concern. From here on, Ryoma and Kondo are one, and we will start a new life.",
    "poise": "60%",
    "ad": "60%",
    "ap": "50%",
    "difficulty": "20%",
    "stats": {
      "health": {
        "base": "3150",
        "grow": "275"
      },
      "attack": {
        "base": "165",
        "grow": "13"
      },
      "defense": {
        "base": "96",
        "grow": "21.2"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Naginatajutsu",
        "description": "Every 5 seconds, Ryoma's next normal attack unleashes a shadow blade that has a longer range and deals 198 physical damage to each enemy hit and reduces enemy movement speed by 50% for 2 seconds. Enemies hit by the shadow blade at the outer border of the range will suffer an additional 50% physical damage.",
        "icon": "16300",
        "cooldown": {
          "base": "8s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Pinwheel",
        "description": "Ryoma leaps backwards while extending his naginata, dealing 250 (+206) physical damage to surrounding enemies. If Ryoma damages an enemy hero, then Pinwheel's cooldown is reduced by 3 seconds. This effect is not stackable.",
        "icon": "16310",
        "cooldown": {
          "base": "80s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Wailing Blade",
        "description": "Ryoma unleashes a phantom blade that deals 330 (+349) physical damage to the first enemy and 50% damage to subsequent enemies on the path. Enemies at the end of the path will be stunned for 0.75 seconds.",
        "icon": "16320",
        "cooldown": {
          "base": "100s",
          "grow": "-5s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Spectral Ire",
        "description": "Ryoma furiously stabs with his naginata, inflicting up to 4 instances of damage on enemies. Every hit deals 130 (+115) physical damage. For each stab that damages an enemy hero, Ryoma regains 70 (+57) HP (no additional HP gained for hitting multiple enemies with one stab).",
        "icon": "16330",
        "cooldown": {
          "base": "120s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "51.3%",
      "gameRate": "1.3%",
      "kdaScore": "6.7"
    }
  },
  {
    "id": "166",
    "name": "Arthur",
    "title": "The Chosen",
    "type": "warrior",
    "hint": "Use Righteous Fervor when entering fights with Arthur to mark enemies and deal additional damage with subsequent attacks.",
    "story": "The chaos-ending Sword of Justice, and the invincible leader that brought order to the orderless! With the holy sword in his hand and righteousness in his heart, Arthur was the first true leader in human history. He was born in an age when faith had collapsed and the world was shrouded in darkness. Facing frenzied beasts and bloodthirsty demons, the humans lacked not only the strength to defend themselves, but also guidance from the gods, which could have prevented their civil wars. This era of turmoil persisted until Arthur rose. Preaching principles of justice and honor, he started down the path of order and discipline as a knight. Arthur's chivalry was well-received and admired by all, drawing brave human warriors from far and wide to pledge their allegiance to him. Under his leadership, they formed a valiant order of knights trained in the art of war. They marched under the banner of justice and valor in the name of Arthur. They toured the land, exterminating evil along the way. Most importantly, they established order and peace amidst the darkness, ensuring humanity's survival. The deeds of the Order greatly impeded the demon legion's invasion plans. Arthur had become a thorn in Maloch's side, and his knights were attacked at every turn. However, the Order was not shaken one bit. Arthur and his knights resolutely stood their ground. Their resilience and persistence inspired all. Young men flocked at the opportunity to become a part of the Order. Any vacant positions in their ranks were promptly filled. This band of brothers, loyal to both the chivalric spirit and their leader gradually grew into a force to be reckoned with. Humans, long looked down on by the other races, were finally earning the recognition and respect of all. Even their age-long rival, the Afata, extended the hand of friendship to Arthur. The secluded Veda brought the blessings of the gods upon the Order and its knights. Arthur and his chivalric spirit gave courage to humankind and his successors, notably Thane, to pass on the torch from one generation to the next. The radiance of the Sword of Justice shall cast its light upon the path of every knight!",
    "poise": "60%",
    "ad": "60%",
    "ap": "50%",
    "difficulty": "20%",
    "stats": {
      "health": {
        "base": "3622",
        "grow": "316.3"
      },
      "attack": {
        "base": "164",
        "grow": "13"
      },
      "defense": {
        "base": "98",
        "grow": "21.6"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Paragon",
        "description": "Arthur is blessed by the heavens and gains 28 armor (scales with hero level).",
        "icon": "16600",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Righteous Fervor",
        "description": "Arthur powers up, raising his movement speed by 30%. During his next normal attack, Arthur leaps at his target, dealing 180 (+164) physical damage and slowing their movement speed by 90% for 1 second. The enemy hero damaged by this ability will be marked for 5 seconds. Marked enemy heroes will suffer additional damage from Arthur's normal attacks and abilities equal to 1% of their maximum HP as magic damage. This ability also raises the movement speed of nearby ally heroes for 5 seconds.",
        "icon": "16610",
        "cooldown": {
          "base": "100s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Holy Guard",
        "description": "Arthur summons divine blades that circle around him, dealing 100 (+57) (+0) magic damage per hit for 5 seconds.",
        "icon": "16620",
        "cooldown": {
          "base": "120s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Deep Impact",
        "description": "Arthur jumps up high and crashes towards an enemy hero, dealing 750 (+213) physical damage and knocking surrounding enemies into the air for 0.5 seconds. Enemies caught in the blast radius suffer 100 (+57) physical damage every second for 5 seconds.",
        "icon": "16630",
        "cooldown": {
          "base": "420s",
          "grow": "-70s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "49.7%",
      "gameRate": "6.6%",
      "kdaScore": "6.5"
    }
  },
  {
    "id": "167",
    "name": "Wukong",
    "title": "The Monkey King",
    "type": "assassin",
    "hint": "Remember to hit enemies with a normal attack after using an ability to properly utilize the additional damage from Wukong's passive. Follow this with another ability immediately to continue the combo. If any of these hits are critical, it will deal a ton of damage.",
    "story": "My magic staff is getting rusty! After completing the journey to the west, Wukong earned the title, Victorious Fighting Buddha for all his accomplishments, and he got to stay at Pūrva-videha to enjoy all the donations from the mortals. However, such a peaceful life was not suitable for the restless Wukong, who always thought about his days of adventuring on the Silk Road. Wukong had traveled thousands and thousands of miles by foot, and survived 81 tribulations. With the staff in hand, he defeated countless fierce monsters, increasing the body count along the way to the West. Wukong was never warm-hearted or well-behaved. Had he not been on Gautama Buddha's leash, he would have gotten into fights every day, even after becoming a god. When the crisis of Athanor spread to Pūrva-videha, Wukong knew that it was the chance he had been waiting for. Pretending to investigate the crisis, Wukong volunteered to head for Athanor, where he returned to his old self, alerting all heroes to his presence. As divinity tends to attract one another, Ilumia the Seer was the first to converse with Wukong. By her invitation, Wukong became one of the members of the Holy Hall and enjoyed the donations with the other deities. Ilumia promised that Wukong would not be bound by rules as long as he did no harm to Vedä. In other words, Wukong could battle any enemy hero at any time. I've been idle for 500 years. I can't wait any longer!",
    "poise": "40%",
    "ad": "50%",
    "ap": "50%",
    "difficulty": "50%",
    "stats": {
      "health": {
        "base": "3305",
        "grow": "265.2"
      },
      "attack": {
        "base": "167",
        "grow": "13"
      },
      "defense": {
        "base": "98",
        "grow": "21.6"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Sprint",
        "description": "Increases movement speed by 30% for 10 seconds.",
        "icon": "80109",
        "cooldown": "100s"
      }
    ],
    "skills": [
      {
        "name": "God of War",
        "description": "Each time Wukong uses an ability, his next normal attack is enhanced and deals an additional 330 (+167) physical damage. Wukong also tumbles toward the target. Wukong's staff grants 15% critical chance permanently.",
        "icon": "16700",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Shadow Clone",
        "description": "Wukong temporarily disappears and gains 40% movement speed for 1 second.",
        "icon": "16720",
        "cooldown": {
          "base": "150s",
          "grow": "-12s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "5"
        }
      },
      {
        "name": "Great Sage",
        "description": "Wukong tumbles towards the specified direction, gaining 100 armor and magic defense for 3 seconds.",
        "icon": "16710",
        "cooldown": {
          "base": "80s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "5"
        }
      },
      {
        "name": "Monkey Business",
        "description": "Wukong unleashes his inner Chi, dealing 150(+83) physical damage to nearby enemies and stunning them for 1 second.",
        "icon": "16730",
        "cooldown": {
          "base": "360s",
          "grow": "-60s"
        },
        "energy": {
          "type": "mana",
          "base": "150",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "48.8%",
      "gameRate": "1.9%",
      "kdaScore": "6.6"
    }
  },
  {
    "id": "168",
    "name": "Lumburr",
    "title": "The Elemental",
    "type": "support",
    "hint": "As a support hero, Lumburr should be with allies at all times. Earth Splitter has a brief delay, so try to anticipate the enemy's movements. Use his abilities to open space in a team fight and supply allies with the opportunity to attack.",
    "story": "Ashes to ashes, dust to dust! Without the element of earth, this world would be nothing! As the manifestation of Mother Earth's will, Lumburr was bestowed with sentience and unmatched resolve. He had silently guarded the earth and its creatures for millennia. Lumburr acted in accordance with the laws of nature: the survival of the fittest! With this single law as his moral code, he never intervened between the wars of Men and Beasts.  That is nature's way.  However, Lumburr could not stand idly by when he saw the unnatural forces of Hell destroying everything within their path. Witnessing their brutality firsthand, Lumburr was more than willing to take the burden of war onto his powerful shoulders. Without hesitation, he emerged from the forest and threw himself into the fray.  After engaging in countless battles, Lumburr was soon recognized as the most reliable defensive force for the Allied Army. In fact, once Lumburr's mountainous form began rampaging across the battlefield none stood a chance at victory. I must eradicate all those who would oppose nature!",
    "poise": "90%",
    "ad": "20%",
    "ap": "50%",
    "difficulty": "70%",
    "stats": {
      "health": {
        "base": "3537",
        "grow": "352.8"
      },
      "attack": {
        "base": "156",
        "grow": "8.4"
      },
      "defense": {
        "base": "109",
        "grow": "20.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Protect",
        "description": "When there are friendly heroes within 500 units of Lumburr, both Lumburr and the hero with the lowest HP gain 80 armor and magic defense.",
        "icon": "16800",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Shattered Earth",
        "description": "Lumburr smashes the ground and shatters stones, dealing 230 (+156) physical damage to enemies in a frontal cone. Heroes hit by the stones are weakened, reducing their attack damage and ability power by 15% for 3 seconds.",
        "icon": "16810",
        "cooldown": {
          "base": "60s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "55",
          "grow": "5"
        }
      },
      {
        "name": "Rampage",
        "description": "Lumburr charges in the target direction, dealing 300 (+95) physical damage to enemies in his way and knocking them into the air. Affected enemies are slowed by 50% for 1 second after they land. Friendly heroes on the path will receive a shield that absorbs 450 (+78) damage and gain 15% movement speed for 3 seconds.",
        "icon": "16820",
        "cooldown": {
          "base": "150s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      },
      {
        "name": "Earth Splitter",
        "description": "After a short charging period, Lumburr tears the ground apart with great strength and knocks enemies on the path into the air, dealing 520 (+168) physical damage. The earth stays torn for 5 seconds, and enemies within suffer a 60% movement speed reduction, as well as taking 52 (+16) physical damage.",
        "icon": "16830",
        "cooldown": {
          "base": "400s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "150",
          "grow": "30"
        }
      }
    ],
    "history": {
      "winRate": "52.3%",
      "gameRate": "0.4%",
      "kdaScore": "6.6"
    }
  },
  {
    "id": "169",
    "name": "Slimz",
    "title": "The Trustworthy",
    "type": "marksman",
    "hint": "Keep moving around the map with Slimz early in matches. Try to launch surprise attacks on enemy heroes by stunning them with Flying Spear. Later in matches, use Savage Potion before attacking enemies or entering team fights to inflict more damage on your targets.",
    "story": "Fairness is the most important thing in any trade! Slimz operated in the lands between the Castle of Inception and the Forest of Shadows. Like many traders, he had always believed in the business principle of fairness. Once conditions for a trade were met, Slimz demonstrated this fairness by milking his business associates dry. Under the guise of being a successful merchant, Slimz ended up taking complete control of all transactions conducted in the border lands and became the ruler of this gray realm. After war broke out, Slimz recognized a business opportunity and persuaded the arms specialist Moen to build a Castle of Alchemy in the border lands. This castle would serve as a continuous supply of weapons and equipment to warring men, beasts, or anything else that could pay the price. After all, Slimz was a trader and neutral in the matter. Business boomed for Slimz and he accumulated an astounding fortune, yet the scope of the war grew larger and larger. To protect his wealth and the flow of his business, Slimz had the foresight to build a private army that comprised of wild beasts, men and alchemy puppets. Unfortunately for Slimz, it was Preyta, the supreme commander of the Fallen, who was the first to go after his wealth. Slimz fought tooth and nail and even enlisted the support of Omega, the Awoken Mech for support, but he was unable to save the Castle of Alchemy from its ultimate fate. His wealth, which took him many years to accumulate, was lost in a single night. Hungry to regain his wealth and status, Slimz returned to the Forest of Shadows and entered a new agreement with Tel'Annas, the Queen of Spirits: The agreement stated that the queen would mobilize forces to retake the Castle of Alchemy, while Slimz remained in the Forest of Shadows and protected it in her absence. The debt you owe me will be repaid one day!",
    "poise": "20%",
    "ad": "80%",
    "ap": "40%",
    "difficulty": "40%",
    "stats": {
      "health": {
        "base": "3389",
        "grow": "207.9"
      },
      "attack": {
        "base": "172",
        "grow": "17.1"
      },
      "defense": {
        "base": "89",
        "grow": "18.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Piercing",
        "description": "Every 3rd normal attack from Slimz gains a pierce effect where both the target and enemies behind them take 130% of the normal physical damage.",
        "icon": "16900",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Flying Spear",
        "description": "Slimz throws a flying spear, dealing a minimum of 150 (+86) physical damage and up to double the base damage as well as stunning the target for up to 2.5 seconds (effects based on distance the spear has traveled). Upon hitting an enemy, Slimz's attack speed is increased by 25% for 5 seconds and if the hit enemy is an enemy hero, Slimz's movement speed is also increased by 60% for 1 second. The spear deals additional 100 true damage when hitting monsters or minions.",
        "icon": "16910",
        "cooldown": {
          "base": "100s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "65",
          "grow": "5"
        }
      },
      {
        "name": "Leap of Vitality",
        "description": "Slimz leaps to a specified location and increases his attack damage by 50 for 5 seconds after he lands.",
        "icon": "16920",
        "cooldown": {
          "base": "80s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "75",
          "grow": "5"
        }
      },
      {
        "name": "Savage Potion",
        "description": "Slimz activates his primal instincts and enhances his normal attacks to deal additional physical damage equal to 4% of the target's maximum HP (up to 150 damage for monsters). His movement speed is also increased by 20% for 8 seconds. Each kill or assist extends the ability's effects by 3 seconds.",
        "icon": "16930",
        "cooldown": {
          "base": "440s",
          "grow": "-40s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "25"
        }
      }
    ],
    "history": {
      "winRate": "50.0%",
      "gameRate": "0.5%",
      "kdaScore": "6.7"
    }
  },
  {
    "id": "170",
    "name": "Moren",
    "title": "The Technowiz",
    "type": "marksman",
    "hint": "Moren is a powerful Marksman that gets stronger as the battle rages on. Farm with Precision to buy better equipment that increases both survivability and damage.",
    "story": "You call that a gun?!? Were it not for his violent and stubborn temper, perhaps Moren would have become a scholar, quietly studying in a tower somewhere. But being a dwarf, Moren was born to drink and fight, preferring fists and bullets over words even when the debate was academic. As a result, no scholars wanted to take him on as an apprentice. This forced him to use his dexterous hands to forge another path: science and blacksmithing. According to (somewhat incomplete) statistics, nearly half of the most highly regarded weapons in the land were either crafted or modified by Moren. Therefore, everyone, from the mightiest of Gods to the most despicable of demons, holds him in high regard. This also meant that Moren was able to maintain a neutral position and, in some ways, remain above it all, for a very long time.  Slimz the Trustworthy sensed a new business opportunity in Moren's weapon forging abilities. After haggling over the price, the two eventually signed a lifetime contract. From then on, Slimz had complete ownership of all weapons created by Moren. In return, Moren received several precious mechanical diagrams, an endless supply of materials, and the Castle of Alchemy. This partnership made both parties extremely wealthy, but it also made them the new target of the Army of the Fallen. Following a joint assault by Preyta and Skud, the Castle of Alchemy suffered a devastating defeat. Slimz hoped to retain at least some influence, but he had nothing left to bargain with, and could not persuade the stubborn Moren to stop resisting. He had no choice but to terminate the contract and make Moren a free agent again. Deeply moved by this, Moren deployed his few remaining weapons at the castle and launched a final attack that halted the enemy's advance. Moren's actions enraged Skud who, in a devastating fit of rage, completely annihilated the castle's defenses and all but destroyed Omega, who had recently arrived to aid the castle's defense. Moren, who was seriously injured, attempted to detonate an incendiary bomb that would have taken Skud down with him. However, Omega dragged him to safety before he could detonate the bomb. Moren was grateful yet resentful. Eventually, he followed Omega's advice and accepted a proposal by Thane, the human commander.  In exchange, Omega shared with him the secrets of advanced mechanical principles, allowing him to create a new generation of high-tech weaponry.",
    "poise": "30%",
    "ad": "70%",
    "ap": "30%",
    "difficulty": "60%",
    "stats": {
      "health": {
        "base": "3081",
        "grow": "189"
      },
      "attack": {
        "base": "169",
        "grow": "16.8"
      },
      "defense": {
        "base": "88",
        "grow": "15.8"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Precision",
        "description": "Every successful attack and ability places a Mark of Precision on Moren. At 5 stacks, the cooldown for Tactical Maneuver is refreshed immediately and Moren gains 12-26% (1% increase per level) life steal.",
        "icon": "17000",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Tactical Maneuver",
        "description": "Moren's movement speed is increased by 40% for 1.5 seconds. His next normal attack within 5 seconds fires 2 bullets, each dealing 25 (+143) physical damage. Moren also gains 25 armor and magic defense for 5 seconds. These effects can be extended by successfully landing normal attacks up to 7 times.",
        "icon": "17010",
        "cooldown": {
          "base": "90s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "35",
          "grow": "0"
        }
      },
      {
        "name": "Impact Barrage",
        "description": "Moren knocks back enemies and deals 150 (+101) physical damage. Also reduces enemy movement speed by 30% for 2 seconds.",
        "icon": "17020",
        "cooldown": {
          "base": "120s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "10"
        }
      },
      {
        "name": "Magnetic Storm",
        "description": "Moren launches a magnetic grenade towards the target area. The explosion triggers a magnetic storm over 2.5 seconds, dealing 180 (+50)  physical damage 6 times to enemies in the area and reducing their movement speed by 50%. Enemies knocked into the storm by Impact Barrage are also stunned for 1.5 seconds.",
        "icon": "17030",
        "cooldown": {
          "base": "350s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "48.6%",
      "gameRate": "0.3%",
      "kdaScore": "6.3"
    }
  },
  {
    "id": "171",
    "name": "Cresht",
    "title": "The Mermidon",
    "type": "tank",
    "hint": "Cresht is great at protecting allies. Use Aquatic Shield to give allies a shield in team fights. He is incredibly powerful after using Metamorphosis as he is granted a massive shield and his damage output increases. After morphing, target the strongest enemies to give your team the best advantage.",
    "story": "Strength or death! Cresht, the Mermidon, frequently talked of the Boiling Sea from which he came from. However, when dealing with Cresht, one would do well to remember that this sea was not called so because of its temperature, but because of the constant chaos beneath its waters, and that he remained at the top of its food chain. Ancient records didn't contain much detail regarding Cresht's origins. The only relevant knowledge that man was able to garner came from a bard's song: A monstrosity rising from the sea's hungry depths; its trident so terrible it brings naught but death.  In the War of Man and Beast, Cresht fought fearlessly on the front lines, endlessly tormenting the humans. Surprisingly, Cresht didn't return to the Boiling Sea after the war. Instead, he took it upon himself to pursue higher goals than just devouring the frail and weak. A battle between Gods and Demons must include Cresht!",
    "poise": "90%",
    "ad": "20%",
    "ap": "50%",
    "difficulty": "70%",
    "stats": {
      "health": {
        "base": "3450",
        "grow": "349.4"
      },
      "attack": {
        "base": "153",
        "grow": "10.6"
      },
      "defense": {
        "base": "125",
        "grow": "27.1"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Daze",
        "description": "Stuns nearby enemies for 0.5 seconds, then reduces their movement speed for 1 second.",
        "icon": "80103",
        "cooldown": "90s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Tidal Rage",
        "description": "Cresht gains Rage with normal attacks when Metamorphosis is not active. When morphed, Cresht shakes the earth each time he uses an ability, reducing movement speed of enemies in the area by 50% for 2 seconds and significantly increasing his attack damage.",
        "icon": "17100",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Typhoon",
        "description": "Cresht's lance swings grant Rage, knock back surrounding heroes, and deal 360 (+122) physical damage. Under Metamorphosis, Cresht summons a geyser that deals 400 (+191) physical damage.",
        "icon": "17110",
        "cooldown": {
          "base": "60s",
          "grow": "0s"
        },
        "energy": {
          "type": "rage",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Aquatic Shield",
        "description": "Cresht jumps to the target location, summoning a whirlpool that grants friendly heroes a shield, absorbing up to 500 (+72) damage. Cresht also gains Rage. Under Metamorphosis, Cresht jumps to the target location and summons a whirlpool that deals 380 (+144) physical damage to enemies within range.",
        "icon": "17120",
        "cooldown": {
          "base": "100s",
          "grow": "0s"
        },
        "energy": {
          "type": "rage",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Metamorphosis",
        "description": "Cresht consumes all Rage and morphs into his true form, growing in size and gaining an absorption shield. He then summons a massive tidal wave, pushing enemies aside and stunning the enemies at the end of the wave, also dealing 400 (+153) physical damage. Cresht gains movement speed while riding the wave, and loses speed once he leaves it.",
        "icon": "17130",
        "cooldown": {
          "base": "400s",
          "grow": "0s"
        },
        "energy": {
          "type": "rage",
          "base": "100",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "49.6%",
      "gameRate": "1.4%",
      "kdaScore": "6.7"
    }
  },
  {
    "id": "173",
    "name": "Fennik",
    "title": "Vulpis Ignis",
    "type": "marksman",
    "hint": "Fennik can clear lanes quickly thanks to his Hidden Weapons passive. Combined with his normal attacks, his abilities make him very efficient in the jungle. Try to trigger the explosion from Thief's Mark by attacking the enemy with a normal attack after marking them 4 times. This will deal a massive amount of damage to enemies in the area.",
    "story": "Get moving, folks! Fennik was infamous for his transcendent speed. Before Fennik came around, speediness had been overlooked for centuries because humans and beasts alike praised characteristics such as strength and wisdom. Until, despite these traditionally upheld characteristics, Fennik changed the game when his speed eventually became a threat.  Now, not only was speediness praised, but it was also feared. Speediness became a huge advantage not only in battles, but also in everyday life. With his speed as his weapon, theft became nothing more than a hobby to Fennik. Of all the thieves, he has yet to be caught and holds the highest bounty in the continent. There were only two instances in which Fennik was relevant and known universally by humans and beasts: he either raided their belongings or he made them worry about the moment when he would. The only people who condoned Fennik's habits were those who benefited from them. Those who were victims of his theft and those who were rewarded were not arbitrary, Fennik unintentionally tried to find a middle-ground between the fortunate and the less fortunate. Nothing pleased him more than seeing the chagrin on the faces of his wealthy victims who he had just stolen from and the gratitude on the faces of the less-fortunate when receiving unexpected gifts. Fennik embodied a childlike spirit and embraced the art of tomfoolery. Money was merely an objective, his priorities laid deeper within. What is life? Being happy of course!",
    "poise": "20%",
    "ad": "80%",
    "ap": "50%",
    "difficulty": "70%",
    "stats": {
      "health": {
        "base": "3007",
        "grow": "194.2"
      },
      "attack": {
        "base": "161",
        "grow": "16.8"
      },
      "defense": {
        "base": "87",
        "grow": "18.1"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Hidden Weapons",
        "description": "When a normal attack hits an enemy, the projectile explodes and deals area damage to surrounding minions and monsters. Fennik has a slightly longer attack range than any other marksman with positioning abilities.",
        "icon": "17300",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Thief's Mark",
        "description": "Fennik increases his attack speed by 25% and places a mark on an enemy or building. The mark explodes around the target after 4 seconds, dealing area-wide 160 (+80) physical damage. Fennik's normal attacks deal an extra 160 (+80) physical damage on marked targets. The mark explodes immediately after reaching 4 stacks.",
        "icon": "17310",
        "cooldown": {
          "base": "110s",
          "grow": "-8s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "5"
        }
      },
      {
        "name": "Rolling Lightning",
        "description": "Fennik rolls forward and reduces enemies' movement speed by 50% for 2 seconds, and deals 80 (+107) physical damage to enemies in his path. Traces of lightning on the path deal 30 (+40) physical damage to enemies every 0.25 seconds.",
        "icon": "17320",
        "cooldown": {
          "base": "120s",
          "grow": "-5s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "5"
        }
      },
      {
        "name": "Chain Hammer Cyclone",
        "description": "Fennik throws a flail to create a thunder cyclone that lasts for 6 seconds, reducing enemies' movement speed by 50% for 1 second while dealing 80 (+56) physical damage to them every 0.5 seconds. Enemies within the center of the thunder cyclone also take double damage.",
        "icon": "17330",
        "cooldown": {
          "base": "360s",
          "grow": "-60s"
        },
        "energy": {
          "type": "mana",
          "base": "130",
          "grow": "10"
        }
      }
    ],
    "history": {
      "winRate": "47.2%",
      "gameRate": "0.7%",
      "kdaScore": "6.2"
    }
  },
  {
    "id": "174",
    "name": "The Joker",
    "title": "The Clown Prince of Crime",
    "type": "marksman",
    "hint": "The Joker reloads his clips with enhanced bullets once he exits a fight. Use these enhanced attacks wisely to deal additional damage at key moments. Increase the hit rate of The Killing Joke by hitting enemies with Punch Line first to reduce their movement speed.",
    "story": "The Joker's origins are shrouded in mystery, but what is known is that he was once a small-time criminal who, after a freak accident, transformed into the Clown Prince of Crime. The Joker's belief that life can change at any moment drives his thirst for chaos, which has fueled his reign of terror in Gotham City. Believing that life is nothing more than a cosmic joke, the Joker has dedicated himself to showing others—the whole world, even—that in one moment, your whole life can get turned upside down.  The Joker has kidnapped, crippled, maimed, murdered, and tortured countless individuals throughout the world, but his locus of operations is Gotham City. Or, it was. In Gotham, the Joker was obsessed with the punchline to his best joke: the destruction of Batman's ideals. Yet, try as he might, no matter how agonizing nor how elaborate the situation, Batman refused to give in to the Joker's games. Even after the Joker's actions cost Batman some of his dearest allies, the Dark Knight would not break. Instead, Batman turned the tables on the Joker by utilizing a highly modified version of Scarecrow's fear toxin.  Prior to this moment, the Joker had never truly tasted fear. With Batman's altered fear toxin sluicing through his veins, the Joker was terrified for the first time. The traumatic nature of the experience was enough to unmoor the last fastenings of the Joker's sanity. Rather than stand trial for his crimes, he was committed to Arkham Asylum. Here, the Joker was a comedian without a joke. What could be truly funny in the face of true terror? The Joker began to despair that he might never laugh at the world ever again.  That changed when a new inmate was brought into Arkham. This man, too, was mad, but in between his demented ravings he spouted lucid streams of mathematical equations and whispered incantations in hushed tones. And when he would sleep, a single phrase was on his lips: Athanor… Athanor. The man's madness intrigued the Joker. With some charm and deception Joker befriended the inmate and learned of where the man had come from. A scientist in a former life, the Arkham inmate had studied radiation spikes across the world that coincided with paranormal phenomena. The scientist had found the answer to these riddles: a portal to another world.  The scientist spoke of this realm, Athanor, with reverent tones. It was clear that the experience had changed the scientist profoundly. The Joker was not in search of spiritual enlightenment or an experience that would cure his madness; no, he longed to see this world of beauty and order, so that he might make a grand joke of it. With his mind finally resolved to a productive endeavor, the Joker escaped Arkham, as he had so many times before. This time, instead of wreaking havoc upon Gotham, the newly freed Joker made for Athanor.  After months of searching, the Joker finally found the portal to Athanor. And now, even the gods who contend to rule that realm will have to wrestle with the man who is chaos personified.",
    "poise": "20%",
    "ad": "80%",
    "ap": "50%",
    "difficulty": "70%",
    "stats": {
      "health": {
        "base": "2977",
        "grow": "192.3"
      },
      "attack": {
        "base": "165",
        "grow": "17.3"
      },
      "defense": {
        "base": "84",
        "grow": "17.5"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Punch Line",
        "description": "After exiting battle, The Joker reloads his gun with enhanced bullets so that his next normal attack deals bonus 200 (+165) physical damage and increases attack range. The enhanced bullets also reduce the target's movement speed by 90% and gradually weakens over 1.5 seconds.",
        "icon": "17400",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "The Killing Joke",
        "description": "The Joker launches a powerful rocket that deals 365 (+297) physical damage to enemies in its path, but each subsequent enemy hit reduces its damage by 10%, up to 40%.",
        "icon": "17410",
        "cooldown": {
          "base": "50s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "5"
        }
      },
      {
        "name": "Pick a Card, Any Card",
        "description": "Using his cunning and guile, The Joker removes all slowdown effects on him and gains 30% movement speed as well as immunity to physical damage for 2 seconds.",
        "icon": "17420",
        "cooldown": {
          "base": "150s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "80",
          "grow": "10"
        }
      },
      {
        "name": "Canned Laughter",
        "description": "The Joker rushes towards the target, stuns them for a short time and attaches a canister of laughing gas to them before spinning back to his original position. He cannot be targeted during the action. The canister explodes, dealing 440 (+396) physical damage. The gas released reduces the target's movement speed by 90% with the effect gradually weakening over 1.5 seconds.",
        "icon": "17430",
        "cooldown": {
          "base": "200s",
          "grow": "-30s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "10"
        }
      }
    ],
    "history": {
      "winRate": "49.3%",
      "gameRate": "1.8%",
      "kdaScore": "6.8"
    }
  },
  {
    "id": "175",
    "name": "Grakk",
    "title": "The Glutton",
    "type": "tank",
    "hint": "Grakk can hook enemy heroes from far distances, so try to hide in the brush when you are using Grakk to take key damage dealers out of the fight. Grakk also continues to pose a large threat after he dies. Finding a strategic death location at the right time will help your team immensely.",
    "story": "Grakk was known for his brutality. As the executioner, he shackled imprisoned souls, and tore open the offending souls with his teeth to torture them. He had to pay a steep price for this though. The price was that he could no longer digest any food other than souls. He needed to devour souls to satisfy his constant hunger.  To stave off hunger during times of peace, he had to ask for help from Zephys and Nakroth; the former harvested souls while the latter past judgment. All guilty souls became his food. After the war broke out, in return for Grakk's strength, Maloch promised Grakk that he could do whatever he wanted with the enemies he captured. The never-ending feast turned Grakk into a war maniac. With every fresh soul consumed, his power grew. He turned all of the things he could not eat into the Fallen to capture more food for him. I… hunger…",
    "poise": "90%",
    "ad": "30%",
    "ap": "70%",
    "difficulty": "80%",
    "stats": {
      "health": {
        "base": "3742",
        "grow": "270.5"
      },
      "attack": {
        "base": "158",
        "grow": "8.3"
      },
      "defense": {
        "base": "104",
        "grow": "21.7"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Flicker",
        "description": "Teleports your hero a short distance.",
        "icon": "80115",
        "cooldown": "120s"
      },
      {
        "name": "Daze",
        "description": "Stuns nearby enemies for 0.5 seconds, then reduces their movement speed for 1 second.",
        "icon": "80103",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Blood Ritual",
        "description": "Whenever Grakk receives damage equal to more than 10% of his current HP in a single blow, he triggers an explosion, dealing 40 (+0) (+74) (2% of his own maximum HP) magic damage to enemies within 500 units (2-second cooldown). Grakk will also trigger an explosion 3 seconds after his death, dealing 160 (+0) (+299) (8% of his own maximum HP) magic damage to enemies within 500 units.",
        "icon": "17500",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Earthquake",
        "description": "Grakk stomps, dealing 150 (+0) magic damage to enemies within range and reducing their movement speed by 30% for 2 seconds. Enemies closer to Grakk will take double the damage and their movement speed will be further reduced.",
        "icon": "17510",
        "cooldown": {
          "base": "40s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "5"
        }
      },
      {
        "name": "Devil's Chain",
        "description": "Grakk throws a hook to pull the first enemy hit towards him, dealing 625 (+0) magic damage.\n\nAfter this ability has been learned, Grakk's maximum HP will be increased by 125 with each kill or assist (up to 20 times).",
        "icon": "17520",
        "cooldown": {
          "base": "170s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "10"
        }
      },
      {
        "name": "World Devourer",
        "description": "After a short delay, Grakk pulls in enemies in front of him, stunning them and dealing a total of 1200 (+0) magic damage during the pull. Grakk also gains a shield if the ability hits at least 1 enemy. This ability must be channeled and has a maximum duration of 3 seconds. Moving or using another ability after 1.2 seconds of channeling will interrupt this ability.",
        "icon": "17530",
        "cooldown": {
          "base": "400s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "130",
          "grow": "15"
        }
      }
    ],
    "history": {
      "winRate": "49.8%",
      "gameRate": "4.3%",
      "kdaScore": "6.5"
    }
  },
  {
    "id": "184",
    "name": "Peura",
    "title": "Guardian of the Glade",
    "type": "support",
    "hint": "Peura does not deal much damage but she plays an important role in protecting her team. She performs best with an ally nearby. Use Nature's Rally after the enemy has used up their control abilities.",
    "story": "The first time Peura saw the wings of Lauriel, she was being wildly chased by Aleister. In fact, after Aleister defected from the Bright Temple, he started coveting the Fountain of Light under Lauriel's protection. After all, it was a key ingredient for his magic experiments.  Lauriel fell under siege of the Fallen and suffered severe injuries. She was left with no other choice but to escape into the Dark Forest. This is when she encountered the forest guardian, Peura, who lent her a helping hand. However, Peura had no way to resist the destructive power of Aleister's magic. In order to prevent Aleister from succeeding, Lauriel handed the Fountain of Light to Peura and stood her ground so that she may escape. Aleister was very cunning however. He didn't give them any chance as he dropped thunder on them and turned them black and blue. I will drink this all before I let him succeed! The weakened Peura used her last bit of energy to drink the Fountain of Light and the light energy it contained burst throughout her body. In fact, the overflow of power even burst forward and healed the prostrate Lauriel before her eyes. With Peura's help, Lauriel recovered and successfully defeated Aleister. After it was all over, Lauriel invited Peura to join the Temple of Light, but she politely refused. I have a sworn oath to protect the Dark Forest, but visitors from the Bright Temple will always be considered friends.",
    "poise": "50%",
    "ad": "30%",
    "ap": "90%",
    "difficulty": "40%",
    "stats": {
      "health": {
        "base": "3238",
        "grow": "190.9"
      },
      "attack": {
        "base": "159",
        "grow": "9.5"
      },
      "defense": {
        "base": "96",
        "grow": "18.2"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Daze",
        "description": "Stuns nearby enemies for 0.5 seconds, then reduces their movement speed for 1 second.",
        "icon": "80103",
        "cooldown": "90s"
      },
      {
        "name": "Heal",
        "description": "You and nearby teammates instantly recover 15% HP and gain 15% movement speed for 2 seconds.",
        "icon": "80102",
        "cooldown": "120s"
      }
    ],
    "skills": [
      {
        "name": "Riposte",
        "description": "When Peura takes damage, she counterattacks and deals 200 (+0) magic damage to the attackers and slows their movement speed by 90% for 1 second. This effect only triggers once every 10 seconds.",
        "icon": "18400",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Healing Light",
        "description": "Peura uses healing magic to restore 60 (+0) (10% of target's lost HP) HP for herself and nearby friendly heroes. Also increases attack speed by 25% for 3 seconds.",
        "icon": "18410",
        "cooldown": {
          "base": "200s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "20"
        }
      },
      {
        "name": "Forest Sentry",
        "description": "Peura summons an owl to attack enemies. The owl flies between the enemy units and deals 200 (+0) magic damage each hit (up to 6 hits) and stuns enemies temporarily. When there are 2 or more enemy targets, the same enemy can be hit more than once.",
        "icon": "18420",
        "cooldown": {
          "base": "100s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Nature's Rally",
        "description": "Peura creates a zone that increases armor of nearby friendly units by 200. Enemy units in the zone suffers 250 (+0) magic damage every 0.5 seconds and 20% reduced movement speed while in the zone. Enemies who remain in the zone for more than 2 seconds are stunned for 1.5 seconds. This ability must be channeled and has a maximum duration of 5 seconds. Moving or using another ability after 0.6 seconds of channeling will interrupt this ability.",
        "icon": "18430",
        "cooldown": {
          "base": "600s",
          "grow": "-100s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "20"
        }
      }
    ],
    "history": {
      "winRate": "53.4%",
      "gameRate": "0.3%",
      "kdaScore": "6.9"
    }
  },
  {
    "id": "126",
    "name": "Arduin",
    "title": "The Spirit",
    "type": "warrior",
    "hint": "Keep an eye on your ability use rate. Arduin is most powerful when you make use of Undying Protector to buff your normal attacks in conjunction with the healing abilities of Bloodlust.",
    "story": "Arduin was the leader of mankind trained by the Vedä. Brave and perseverant, Arduin was the epitome of a great leader in the public's eye. His speech was so affectionate and evoking, it attracted young and passionate rebel warriors to join his legion, fighting for a higher goal. Instructed by the Vedä, Arduin once regarded Thane as his rival. He decided to fight Thane for honor, but won Thane's admiration with his fearless combat style and confident tactics. After years of collaboration, Arduin finally accepted Thane as an ally and their friendship grew.  The duo was fundamental to the rebels' victory. The Fallen were forced to withdraw their defense lines and retreat to Inferi. In the last battle, Arduin and Thane quarreled for the first time in a long time. Arduin wanted to keep on battling, in hopes of obliterating the dark forces and bringing back the long-awaited peace, while Thane thought such an action would only devastate what they had achieved so far. Failing to persuade him, Arduin abandoned Thane and, together with his warriors and supporting Vedän squads, marched into Inferi to hunt down the remaining Fallen and demons. Yet, Arduin's legion was misled to the Icy Terrain by the cunning Veera. She ignited the frost fire, hoping to annihilate the entire legion. Feeling a deep regret of his own decision, Arduin strode through the frost fire and created a storm by swinging his ax, attempting to create a safe passage for his warriors. Thanks to Arduin's resourcefulness, a few soldiers managed to survive, but many of their fellows perished in the unforgiving frost fire. Even Arduin himself was scorched in battle, but was saved by the Vedä-blessed armor. Despite the fact that Arduin swung his ax blindly, he managed to kill any enemies who dared to come close. Veera swiftly stepped in and stopped the Fallen from taking revenge. She poured frost fire into Arduin's crippling body, rendering the holy seal of Vedä useless. Soon, Arduin's body was burned to ashes, and though his spirit remained, it was marked with a dark seal by Veera. Freezing frost fire replaced the Holy Force and became the sole driving force of the armor. Those who lament the loss of Arduin will never expect to see their legendary hero again like this!",
    "poise": "40%",
    "ad": "60%",
    "ap": "50%",
    "difficulty": "40%",
    "stats": {
      "health": {
        "base": "3307",
        "grow": "288.8"
      },
      "attack": {
        "base": "159",
        "grow": "11.6"
      },
      "defense": {
        "base": "101",
        "grow": "21.2"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Bloodlust",
        "description": "If Arduin's HP falls below 50%, Arduin will enter Bloodlust mode for 8 seconds. While in Bloodlust mode, Arduin restores 2% of his maximum HP when his abilites or normal attacks damage enemies. Bloodlust has a 60-second cooldown and Arduin will enter Bloodlust mode again immediately after the cooldown if his HP is below 50% at that time.",
        "icon": "12600",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Rend",
        "description": "Arduin swings his axe, sending out an energy arch that deals 250 (+159) physical damage and slows enemy movement speed by 40% for 2 seconds. If Arduin hits an enemy hero, he can also smash his axe into the ground to deal 250 (+159) physical damage and knock enemies into the air for 1 second.",
        "icon": "12610",
        "cooldown": {
          "base": "80s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "5"
        }
      },
      {
        "name": "Undying Protector",
        "description": "Arduin summons a shield that has 12% of his own maximum HP, which lasts for 5 seconds. When the shield is summoned, Arduin deals 200 (+119) magic damage to surrounding enemies. Within 8 seconds of summoning his shield, Arduin's next 3 normal attacks deal an additional 100 true damage, and each time his normal attacks damage an enemy, the cooldown time for Cull is reduced by 1 second.",
        "icon": "12620",
        "cooldown": {
          "base": "120s",
          "grow": "-10s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "5"
        }
      },
      {
        "name": "Cull",
        "description": "Arduin flings his axe forward, dealing 300 (+190) physical damage and stunning the first enemy hit for 1.5 seconds. He then hurls towards the axe's spot, dealing 300 (+190) physical damage to surrounding enemies. Once Cull is activated, control effects will not stop Arduin from completing the ability.",
        "icon": "12630",
        "cooldown": {
          "base": "160s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "50.2%",
      "gameRate": "1.5%",
      "kdaScore": "6.1"
    }
  },
  {
    "id": "501",
    "name": "Tel'Annas",
    "title": "The Ageless",
    "type": "marksman",
    "hint": "Tel'Annas' Eagle Eye has a very long range, so use that to your advantage to keep the enemy from advancing as well as kite them with the passive. When enemies are grouped together, use Arrow of Chaos at the right time to dish out tons of damage, knock them back, and stun them.",
    "story": "After bidding farewell to her verdant homeland where she had slumbered for a millennium, the newly awakened Elven Queen Tel'Annas shone like the morning star. As one of the valiant warriors who resisted the first invasion by the dark forces, the legend of Tel'Annas and her unrivaled archery skills became the subject of numerous songs and poems throughout the centuries. Renowned for her remarkable deeds in the decisive final battle against the invading horde, it was Tel'Annas who shot the lone arrow that mortally wounded the Lord of Darkness, securing the survival of all living things that had lost the protection of the Gods in this terrifying episode in history. However, Tel'Annas paid the ultimate price when her body and mind were corrupted by the dark power unleashed by the Lord of Darkness in his final moment. She was forced to seal herself and fall into a deep sleep that would last a thousand years, until all of the dark power within her was neutralized. For the entire duration of her slumber, Maloch, the successor of the Lord of Darkness, tried to break the seal and take the dark power inside Tel'Annas, but the seal was far stronger than he imagined. Seeing his opportunity during the second invasion by the dark forces, Maloch ordered a massacre of the Afata, forcing Tel'Annas to break the seal and return to the battlefield. Her striking face bore not a trace of the thousand years that had passed, and her mastery over her formidable power showed that she was fully capable of manipulating the explosive dark power that coursed through her. Confronting the army of demons, spirits and corrupted souls, Tel'Annas once again drew her bow to defend the life and dignity of all living things. The radiance of the morning star will forever protect this land.",
    "poise": "10%",
    "ad": "100%",
    "ap": "30%",
    "difficulty": "30%",
    "stats": {
      "health": {
        "base": "3242",
        "grow": "176.3"
      },
      "attack": {
        "base": "157",
        "grow": "15.6"
      },
      "defense": {
        "base": "95",
        "grow": "17.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "The Morning Star",
        "description": "Tel'Annas' attack damage is increased by 10% when there are ally heroes nearby.",
        "icon": "50100",
        "cooldown": {
          "base": "8s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Eagle Eye",
        "description": "After learning this ability, Tel'Annas' normal attacks reduce the target's movement speed by 6%. Stacks up to 5 times.\n\nAfter activating this ability, Tel'Annas' range significantly increases and her attack speed increases by 20% for 3 seconds. Also, her normal attacks are imbued with dark power and deal an additional 35 (+47) magic damage. While active, normal attacks place an additional stack of the movement speed reducing effect.",
        "icon": "50110",
        "cooldown": {
          "base": "100s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "65",
          "grow": "5"
        }
      },
      {
        "name": "Penetrating Shot",
        "description": "Tel'Annas fires 3 arrows simultaneously, dealing 180 (+157) physical damage to enemies in their paths and reducing their movement speed by 30% for 2 seconds. The arrows lose 20% damage for each enemy hit, up to 40% damage loss.",
        "icon": "50120",
        "cooldown": {
          "base": "90s",
          "grow": "-5s"
        },
        "energy": {
          "type": "mana",
          "base": "70",
          "grow": "5"
        }
      },
      {
        "name": "Arrow of Chaos",
        "description": "After charging for a short period, Tel'Annas combines the power of Darkness and Morning Star and fires an Arrow of Chaos, dealing 300 (+157) physical damage. Enemies further away take more damage, up to 600 (+219) physical damage. Enemies along the arrow's path are knocked back and stunned. Tel'Annas gains 20% movement speed for 2 seconds.",
        "icon": "50130",
        "cooldown": {
          "base": "450s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "130",
          "grow": "20"
        }
      }
    ],
    "history": {
      "winRate": "51.8%",
      "gameRate": "4.4%",
      "kdaScore": "6.8"
    }
  },
  {
    "id": "502",
    "name": "Astrid",
    "title": "The Indomitable",
    "type": "warrior",
    "hint": "Dire Blow makes Astrid immune to all damage, which is invaluable when she has low HP. This allows Astrid to deal heavy damage and stun enemies while running to safety.",
    "story": "I will become your sword and cut through thorns for you.  When Astrid bent the knee in front of Thane and to take her vows, she was not yet 18. But as the bearer of the famous sword Embertrail and the legitimate heir of the Duke of Roses, Astrid took up the mantle imposed upon her by history. She raised the Flaming Rose standard high and stood next to Thane, showing the world the allegiance of an old noble house to the new king. With Astrid's support, the doubts that followed Arduin's death eventually quieted and people started to reflect on the failure of Arctica. Even though Astrid's father and brother died in the war, she did not pay any mind to gossip and whispers from the Temple. Her support in Thane's ascension provided some much-needed stability in times of conflict. In return, Thane awarded unprecedented honor to the Rose family, and Astrid became the kingdom's first duchess. But before she could do anything with her territory, dark powers returned with Taara leading the charge. Arduin and Mina, corrupted by dark power, were spotted among their ranks. Astrid knew that the murderous leader was one of those responsible for her father's and brother's deaths. She could not wait to join the battle and avenge them, but Thane gently stopped her. Looking at the girl with affection and care, Thane said, You have done enough for me. I shall take care of the rest. My lord, I don't think you understand, declared Astrid with her head held high, showing resolve that no man of her age would ever possess. I took my vows as a knight. Dukes can wait in their castles for news of victory, but knights must charge into battle! With that said, she unclasped her crimson mantle, unsheathed Embertrail and led her knights to war. My resolve will never waver!",
    "poise": "30%",
    "ad": "60%",
    "ap": "80%",
    "difficulty": "60%",
    "stats": {
      "health": {
        "base": "3465",
        "grow": "262.5"
      },
      "attack": {
        "base": "170",
        "grow": "12.4"
      },
      "defense": {
        "base": "99",
        "grow": "20.8"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Bladed Guardian",
        "description": "When Astrid's HP falls below 80%, she gains a shield that absorbs 450 HP for 4 seconds. The shield effect has a 24-second cooldown and will be reactivated when Astrid takes damage again. While the shield is active, it deals 125 magic damage to surrounding enemies. Cooldown is reduced by 3 seconds every time Astrid hits an enemy hero with an ability or normal attack and by 1.5 seconds every time she hits an enemy minion or monster.",
        "icon": "50200",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Spin Slash",
        "description": "Astrid swings her mighty sword around, dealing 160 (+102) physical damage to surrounding enemies. If she hits an enemy hero, Astrid's attack speed will increase by 20% and an additional 5% for every other hero hit for 3 seconds.",
        "icon": "50210",
        "cooldown": {
          "base": "50s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "5"
        }
      },
      {
        "name": "Fearless Charge",
        "description": "Astrid charges forward, dealing 60 (+85) physical damage, slowing enemy movement speed by 50% for 1.5 seconds, and decreasing target armor by 30% for 4 seconds. Her next normal attack will be a critical hit and will reduce Fearless Charge's cooldown by 1 second. This effect cannot stack.",
        "icon": "50220",
        "cooldown": {
          "base": "100s",
          "grow": "-4s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "5"
        }
      },
      {
        "name": "Dire Blow",
        "description": "Astrid powers up and becomes immune to all damage for 2 seconds. After 1.5 seconds, she swings her sword, dealing 500 (+204) physical damage. For every 2% of her own maximum HP that Astrid has lost, she will deal 1% more damage. The ability also slows the enemy's movement speed by 50% for 1.5 seconds. If the enemy's HP is higher than Astrid's, then the ability also stuns the enemy for 1 second.",
        "icon": "50230",
        "cooldown": {
          "base": "500s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "100",
          "grow": "25"
        }
      }
    ],
    "history": {
      "winRate": "51.0%",
      "gameRate": "0.5%",
      "kdaScore": "6.3"
    }
  },
  {
    "id": "503",
    "name": "Zuka",
    "title": "The Pandharma Master",
    "type": "warrior",
    "hint": "Zuka gains a shield from successful hits with Panda Chariot, so make sure you hit an enemy or a monster when you use this ability. Zuka's positioning abilities take him through most obstacles and can produce unexpected effects on certain terrains.",
    "story": "A true warrior defends the weak and punishes the evil. Zuka was born in a beautiful and prosperous village. It was a hive of activity during the day, but quiet and tranquil during the night. It was a place where people were sheltered from the hardship and misery of the world. However, the one thing the inhabitants of this serene place valued above all else was martial arts. Despite being a young cub, Zuka had to study all manner of combat styles and ascend through the grades by passing the examinations set by his teacher.  The young Zuka could not understand why he needed to do this. After all, why should he spend so much time and effort learning martial arts that he would never need to use? Surely it would be better to help work the fields or engage in scholarly pursuits? In response to Zuka's question, the teacher responded, It is not enough to simply wish for peace, one must have the ability to defend peace! Those words left a deep impression on him. When the fallen souls that emerged from the demon abyss spread plague and chaos across the land, the once peaceful village was mercilessly engulfed in the flames of war. In an effort to flee, the young Zuka embarked on a long journey with his family, crossing treacherous mountains as they made their way to the legendary Forest of Shadows. Zuka had heard about the Forest of Shadows in the stories told by the older villagers. Not only was it home to the legendary Elven Queen, Tel'Annas, but there were also countless elemental and orc warriors. They were the Queen's valiant army, charged with defending the land from evil. During the journey, Zuka witnessed all manner of depraved acts perpetrated by the fallen souls. The martial arts that he had practiced for so many years finally had a use. Wearing armor symbolizing his coming of age, and wielding a staff he made with his own two hands, he fought countless battles against evil and saved those who had suffered at their hands. Tales of Zuka's heroic exploits spread far and wide. From the noble and proud Temple of Light, to the Castle of Inception, which has long been suspicious of animal races, all factions publicly commended Zuka's heroism. Even Queen Tel'Annas herself prepared a lavish welcome ceremony in his honor. Then, at the invitation of Earth Elemental Lumburr, Zuka formally joined the resistance army, becoming a warrior with a duty to eradicate evil and protect peace. No matter where Zuka may be, he is an undisputed symbol of peace!",
    "poise": "20%",
    "ad": "90%",
    "ap": "50%",
    "difficulty": "90%",
    "stats": {
      "health": {
        "base": "3269",
        "grow": "192.8"
      },
      "attack": {
        "base": "170",
        "grow": "15.2"
      },
      "defense": {
        "base": "86",
        "grow": "18.8"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "The Chi",
        "description": "Every 20 seconds, dealing damage to an enemy hero triggers Zuka's Chi, increasing his attack damage by 14/15.5/17/18.5/20% (occurs at Level 1/4/7/10/13) for the next 8 seconds.",
        "icon": "50300",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Pain on a Stick",
        "description": "Zuka raises his staff and charges forward, dealing 120 (+144) physical damage to nearby enemies. This ability can be used again within 5 seconds of the first use and each use enhances Zuka's next normal attack, increasing its range and dealing an additional (+85) physical damage.",
        "icon": "50310",
        "cooldown": {
          "base": "100s",
          "grow": "-8s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Panda Chariot",
        "description": "Zuka rolls forward, dealing 100 (+59) physical damage to enemies in his path. On a successful hit, Zuka gains a shield that absorbs 150 (+255) damage for 2.5 seconds and enhances his next normal attack to deal an additional (+85) physical damage and knock enemies into the air for 0.5 seconds.",
        "icon": "50320",
        "cooldown": {
          "base": "90s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Skyfall",
        "description": "Zuka leaps up and crushes his enemies from above, dealing 400 (+170) physical damage to enemies in the target area and stunning them for 1 second. His next normal attack will deal an additional (+85) physical damage to nearby enemies.",
        "icon": "50330",
        "cooldown": {
          "base": "320s",
          "grow": "-40s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "48.6%",
      "gameRate": "0.8%",
      "kdaScore": "6.3"
    }
  },
  {
    "id": "504",
    "name": "Wonder Woman",
    "title": "Amazon of Themyscira",
    "type": "warrior",
    "hint": "Wonder Woman's Bracelets of Submission ability is effective at controlling your enemies at the outset of a teamfight and then immediately supporting your allies in the thick of it. Be sure to time its use carefully. Lasso of Truth has different effects depending on your enemy's HP, be wary of timing when you activate it.",
    "story": "Wonder Woman is Princess Diana of the immortal Amazons from Greek mythology. When army pilot Steve Trevor crashed on the warriors' secluded island paradise, Diana won the right to escort him home and make her people known to the world. Entering the cynical world of humanity for the first time, Diana found a people who needed a hero. Over the years, the ways of mankind have vexed Diana—war, hate, and a callous disregard for the health of the Earth—but her superhuman strength, speed, bulletproof bracelets, and the famed Lasso of Truth have aided her in the quest to bring order to humanity's chaotic ways.  A warrior by birth and training, Wonder Woman fights evil while hoping to unlock the potential of a humanity she doesn't always understand—and it is this mission that has driven her to work in close concert with the Justice League. However, Wonder Woman's mission to promote peace on Earth is sometimes complicated by the political machinations and familial disagreements of her relatives—the gods and personas of Greek mythology. It was a message from her mother, Hippolyta, that eventually sent Wonder Woman to the realm of Athanor.  Hippolyta had kept a secret from Diana her whole life—a secret that now threatened to tear Mount Olympus apart. Hippolyta confessed that she had a passionate affair with Zeus; the resulting child was none other than Diana. But Wonder Woman had no time to process the emotional uppercut she had just received, as she was attacked by Hera, Zeus' jealous wife. The ensuing battle involved many of the gods, but Wonder Woman was able to quell the fighting by binding Hera with her Lasso of Truth.  Wonder Woman learned that Zeus had been missing from Olympus for some time—and in his absence, the gods were at war with each other, vying for control of Olympus. Zeus had left in search of the source of the gods' power: a star that was rumored to exist at the center of the universe.  Knowing that without peace on Olympus, Earth and humanity would be threatened, Wonder Woman took it upon herself to find Zeus. But Hippolyta cautioned that what she would find in Athanor would make all of her previous challenges feel like child's play. There were gods in Athanor, with strange powers and magic that would rival anything that Wonder Woman had faced.  But Athanor has never seen a hero like Wonder Woman. And when she eventually finds Zeus, what he tells her will have grave ramifications, not just for Olympus… but Earth as well.",
    "poise": "90%",
    "ad": "30%",
    "ap": "70%",
    "difficulty": "80%",
    "stats": {
      "health": {
        "base": "3434",
        "grow": "291.6"
      },
      "attack": {
        "base": "168",
        "grow": "12.7"
      },
      "defense": {
        "base": "89",
        "grow": "22.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Amazon Shield",
        "description": "After 2 normal attacks, Wonder Woman's next normal attack will throw her shield, dealing an additional 84 true damage to all enemies in its path and slowing their movement speed by 50% for 0.5 seconds. If the shield hits an enemy, Wonder Woman will recover 10 (+16) HP. If the shield hits an enemy hero, the HP recovered is tripled.",
        "icon": "50400",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Sword & Shield",
        "description": "Wonder Woman repels her enemies with her sword and shield. Her shield bash deals 40 (+100) (+5% of the target's maximum HP) physical damage and slows enemy movement speed by 20% for 3 seconds. If the shield hits an enemy hero, Wonder Woman will receive 15% damage reduction for 3 seconds.\n\nAfter Wonder Woman bashes with her shield, she can activate the ability again to follow with a sword attack that deals the same amount of physical damage. Enemies hit by the center of her blade suffer double damage.",
        "icon": "50411",
        "cooldown": {
          "base": "90s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Lasso of Truth",
        "description": "Wonder Woman throws her Lasso of Truth around an enemy. If the enemy's HP is greater than 50% of their maximum HP, then Wonder Woman will be pulled towards them, dealing 250 (+168) physical damage. If the enemy's HP is less than or equal to 50% of their maximum HP, then Wonder Woman will pull them towards her, dealing 250 (+168) physical damage. If Wonder Woman hits an enemy with this ability, the cooldown will be reduced by 3 seconds. Targets hit are stunned for a short period of time.",
        "icon": "50420",
        "cooldown": {
          "base": "120s",
          "grow": "-4s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Bracelets of Submission",
        "description": "Wonder Woman builds up her energy and then slams her bracelets together, unleashing an energy wave that deals 400 (+168) physical damage to enemies in front of her and stunning them for 1 second. Wonder Woman and allies behind her receive shields that absorb 600 (+12% of her own maximum HP) damage for 3 seconds. Wonder Woman also increases her movement speed by 80% for 1 second. While she is building energy, Wonder Woman will receive high amounts of damage reduction.",
        "icon": "50430",
        "cooldown": {
          "base": "500s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      }
    ],
    "history": {
      "winRate": "50.4%",
      "gameRate": "1.7%",
      "kdaScore": "7.1"
    }
  },
  {
    "id": "190",
    "name": "Tulen",
    "title": "The Pure",
    "type": "mage",
    "hint": "Use Thunderbird on enemies with low HP to help activate Tulen's passive. Use Lightning Strike to move Tulen to a good position to launch further attacks.",
    "story": "Thunder! At my beck and call! Tulen was a demigod born to the call of thunder and lightning. He was an extraordinary child, able to bend thunder and lightning to his will. The thunder Tulen created was a thousand times stronger than regular magic. Some would call it godlike. Ilumia the Seer saw fit to place him under the tutelage of Aleister in order to learn the intricacies of his powers. Yet, the sly Aleister did not take a liking to Tulen. He sensed that Tulen would one day take his place, and thus decided he would teach Tulen nothing, not a single spell. Unfortunately, for Aleister, this method of teaching worked in Tulen's favor. His innate ability to control thunder allowed him to harness his powers without spells. While his vivid imagination propelled his powers to even greater heights. Tulen's success sent Aleister into a spiral that would eventually lead to his downfall. Tulen was not blind to his teacher's ploy, however. He had no intention of taking Aleister's place. Far from it. Yet, he also had no intention of giving anyone else the throne of thunder. He wanted the absolute freedom Aleister had... something a pupil like him would have great difficulty achieving. Finally, Tulen descended upon the temple with his godlike thunder and wiped away his teacher's sigil, burning his own upon the throne before stunned eyes. In so doing, he proved that he not only had the strength to take Aleister's place, but that the throne of thunder had already chosen him. Then, under Ilumia's guidance, Tulen successfully ascended the throne of thunder. His first task was to recapture the throne's previous owner – his own teacher, Aleister, for without Aleister, Tulen only held the title without the power. Tulen understood that this near-impossible task was given to him to curb his wanton display of power, but he didn't care. No one understands what I truly desire!",
    "poise": "20%",
    "ad": "60%",
    "ap": "80%",
    "difficulty": "80%",
    "stats": {
      "health": {
        "base": "3135",
        "grow": "180"
      },
      "attack": {
        "base": "156",
        "grow": "9.4"
      },
      "defense": {
        "base": "87",
        "grow": "17.4"
      },
      "resistance": {
        "base": "50",
        "grow": "8.5"
      }
    },
    "talents": [
      {
        "name": "Punish",
        "description": "Deals 800 true damage to nearby minions and monsters and stuns them for 1 second.",
        "icon": "80104",
        "cooldown": "30s"
      },
      {
        "name": "Execute",
        "description": "Instantly attacks a nearby enemy hero and deals damage equal to 16% of the HP the enemy hero has lost as true damage.",
        "icon": "80108",
        "cooldown": "90s"
      }
    ],
    "skills": [
      {
        "name": "Thunderclap",
        "description": "Whenever Tulen hits an enemy with an ability, he gains 1 charge of Thunderclap. After reaching 5 charges, he summons 5 lightning bolts that shoot out in sequence towards nearby enemies, prioritizing heroes. Each lightning bolt deals 350 (+0) magic damage. If more than one lightning bolt hits the same target within 1 second, the damage dealt by the subsequent bolts will be reduced by 20%. The lightning bolts will only attack monsters if they're in aggression mode.",
        "icon": "19000",
        "cooldown": {
          "base": "10s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "0",
          "grow": "0"
        }
      },
      {
        "name": "Ion Blasts",
        "description": "Tulen shoots three ion blasts, each dealing 500 (+0) magic damage to enemies along its path. When enemies are hit by more than one blast, each additional hit will deal 30% damage. Each prism that hits an enemy will add 1 Thunderclap charge (1 charge per blast).",
        "icon": "19010",
        "cooldown": {
          "base": "80s",
          "grow": "-6s"
        },
        "energy": {
          "type": "mana",
          "base": "60",
          "grow": "5"
        }
      },
      {
        "name": "Lightning Strike",
        "description": "Tulen uses his lightning powers to zap a short distance, damaging enemies at the origin and destination. Enemies in the origin and destination areas will suffer 350 (+0) magic damage. Enemies damaged by both the origin and the destination areas will receive 50% damage for the second hit. Enemies damaged by Lightning Strike twice within 5 seconds will have their movement speed reduced by 90%, gradually decreasing over the following 3 seconds. Each time Tulen teleports and hits an enemy, he will receive 1 charge of Thunderclap.\n\nTulen can store this ability up to 3 times (cooldown between stored uses can be affected by items and arcana).",
        "icon": "19020",
        "cooldown": {
          "base": "20s",
          "grow": "0s"
        },
        "energy": {
          "type": "mana",
          "base": "50",
          "grow": "5"
        }
      },
      {
        "name": "Thunderbird",
        "description": "Tulen charges up and launches a Thunderbird at an enemy, dealing 360 (+0) (+30% of the target's lost HP) magic damage and giving Tulen 1 charge of Thunderclap. The Thunderbird can be blocked by another enemy hero getting in the way. If the Thunderbird kills an enemy hero, Tulen's passive will be activated immediately and Thunderbird's cooldown will be reduced by 80%. If the Thunderbird hits an enemy minion on the way to its final target, they will suffer magic damage and be knocked into the air.\n\nTulen can also use Lightning Strike while charging Thunderbird.",
        "icon": "19030",
        "cooldown": {
          "base": "350s",
          "grow": "-50s"
        },
        "energy": {
          "type": "mana",
          "base": "120",
          "grow": "20"
        }
      }
    ],
    "history": {
      "winRate": "49.8%",
      "gameRate": "2.3%",
      "kdaScore": "7.1"
    }
  }
]